[
    "Professor Thornton is a phenomenal lecturer, and he is able to provide the perspective of a full-time software engineer as well. ICS 46 is by no means an easy course - the projects are time-consuming and the tests difficult. However, Thornton will give you every opportunity to succeed and grow as a programmer. Accessible, caring, entertaining.",
    "Thornton actually TEACHES. Always accessible. I attended class AND read & took notes from online lecture. This class asks for a lot but it is damn worth it. I feel much more confident in my ability to solve problems. Those projects can be crazy fun & hard. Midterm was 2x harder than the final. Aim to be above the average scores.",
    "Gives amazing lectures that make up for ICS 31, assigns projects that are fun to do, grades the harder projects generously, but talks a bit too much about his dog that he sometimes has to rush the end of lecture, which is the most important part. Also, idk if anyone else suffered from the automated tests he uses to grade the projects, but I did.",
    "Best professor at UCI I've had so far. His lectures always flew by since he knows how to teach. When doing coding examples, he always explains WHY he chooses to solve a problem the way he does. Exams were difficult but not impossible. Projects were hard, so make sure to go to another lab section if you feel your current TA isn't helping you.",
    "Thornton is not an easy professor nor the concepts he teaches. So be prepared to spend a lot of time on this class and make sure you START YOUR PROJECTS EARLY. For midterm and final, just make sure you read his notes. EVERYTHING on the midterm and final is mentioned in his notes at some point. Also Be prepared to study yourself. Good Luck!",
    "Thornton is the best teacher at UCI. Had him for 32, and 46 was also a great class. The midterm and final are hard, but curved like crazy. I was able to get an A. Not an easy class but very useful and important. Wouldn't want to take it with anybody else.",
    "The class is a big leap from ICS 31 so be prepared to work a lot harder. The projects are difficult but doable if you start early on them. The midterm and final are very hard and there are no practice exams. Thankfully there is a generous curve at the end. A third of the class received a C- or below, which means they have to retake the class.",
    "Engaging and interesting lectures. Projects can sometimes be tough, and require a lot of attention to detail to ensure correct implementation of data structures. Picky in the grading of them too - runs lots of hidden test cases against your programs to determine your score. Conceptual & detail-oriented exams that can be tricky.",
    "the projects in this class are totally harder than the previous class. I had an A+ on 31 but I think I will fail in this class, and I have to retake this awful class. He won't give any sample for exams.",
    "Thornton is solid! He's quirky and funny and really makes concepts clear. He has online notes that are basically his lectures which are really helpful. His projects are a bit challenging but teach you a lot. Get ready for lectures about his dog and a good time!",
    "This class wasn't actually that hard because he covered basic/simple topics in a concise/easy-to-understand way. But the midterm and final in his class were extremely difficult. To succeed, read his lecture notes carefully, work hard on the projects and try to do well on them. Professor Thornton curves so bad grades on tests won't screw you over.",
    "Really nice class would take again",
    "Prof. Thornton is an amazing instructor. I wish more CS classes were taught by him. It's not every quarter you come across such an inspirational professor. Get ready to program some 300-500+ lines of code per program.",
    "One of the best ICS lecturers at UCI. Also one of those rare lecturers where every lecture was almost full. Unlike most ICS professors, he didn't just teach some new programming concepts, but he also provided insight on how to go about programming something interesting.",
    "This man is the best of the CS Department of UCI. If I could I would take him all 4 years. God bless you Alex Thornton",
    "Savor this class before you take 33. Make the most your free time now b/c Pattis bouta make your free times only one line. To prep for final just read his notes on his website and make sure you understand it well by testing on python shell.",
    "His programming projects are challenging, but not too hard to solve. His midterm and final are not too hard, but you must be careful with those minor details of Python.",
    "TOOK ICS32A! Though lecture isn't mandatory GO, it helps you for the projects & Thornton tries to be interesting. One midterm & final, 5 projects. Got a 59% on the midterm & a high 60 on the final but only got one B on the 1st project & A's for the rest, so don't worry if you're not the best tester, just do well on the projects & you should pass!",
    "Thornton is a great lecturer! He kept it interesting and fun. The programming assignments were difficult, but I enjoyed them. I highly recommend going to all the lectures but labs are just free coding time, so you don't necessarily need to go. I only went to one lab the entire quarter. Overall, I enjoyed his class and I hope to have him again.",
    "amazing instructor in ICS department. challenging, but doable. You learn a lot of real-world programming technique. tests are tricky so make sure to understand his notes and understand why things work. Interesting lecture you wont feel bored. I wish he teaches some upper divs as well.",
    "This is the course you DO NOT want to make a single mistake. If you didn't pay attention, you pay for it with heavy price. And TA Yoshi, he just takes as much points as he can in the project unless you've done everything perfect.",
    "Alex Thornton teaches good programming and design through intuitive projects. Lectures are amazing, notes and instructions are concise and focused. Just show up to lecture, review the notes, and start the projects early. Go to office hours if you're struggling with design or concepts. He'll be happy to offer resources or re-explain.",
    "Projects aren't nearly as hard as people make them out to be. You might be forced to pull an all nighter at some point in the quarter but what else can you expect from an accelerated CS class. Thornton is reasonable and provides clear grading guidelines. Overall great class and great introduction to university level programming.",
    "Projects weren't as hard as people claim but the grading is atrocious. Uses automated tests to grade homework so one deviation from the write up can fail multiple tests and bomb your project score even when 99% works. Midterm and final make up half your grade and writing code on paper is not a good way to test programming knowledge. Useless Lab.",
    "He might be a good programmer, but for sure not a good teacher. He did not organize the class schedule well which left us had no enough time to finish the last two projects. The projects are extremely complicated and the two tests are extremely hard. Always publish his notes really late and not really useful for the tests.",
    "Great professor, very good at teaching concepts and explaining them, and also humorous. The pacing really in the accelerated 32A class is no issue for most. Projects are mostly easily, except for one that was extremely time consuming. Tests are on the difficult side, but overall, the class was enjoyable.",
    "I think the whole idea of 32A is bad because they try to teach you python during the first week, which is not only a lot of facts thrown at you at once but puts you behind schedule because, which is what happened this time. I disliked the class, projects were hard, notes weren't published on time, and he isn't very approachable for questions",
    "This class really depends on you. It is a very serious class and you should expect to have a lot of work. It might be hard for someone who has just started programming, and someone who is experiencing python for the first time. Thornton is a tough grader and projects are not easy; however, they force the students to come to the lectures.",
    "There can be bad teachers who teach easy classes, and good teachers who teach hard classes. This is an example of a great teacher who teaches a difficult class. He is vibrant, engaging, and is really responsive when you ask for help. You will have to work very hard in this class, but Thornton does everything to help you enjoy doing so.",
    "Honestly think that while the course is difficult by nature, Thornton tries hard to keep the lectures interesting and applicable. The final projects were a bit too difficult to finish given the time constraints, but the overall difficulty is manageable with lecture attendance.",
    "He gave the crazy long, hard project and wanted student to finish within few days. Assuming the students already knew everything and the lectures weren't related to project too much. You have to hand write code in the exam and the exams are crazy hard. The notes always came out late and almost never catch up with lectures.",
    "Expects you to know everything ahead of time and if you don't know a topic, makes you feel bad about it when you ask for help. Labs are very open ended and doesn't help in office hours. Lectures are 90% focused about his dog and last 20 minutes of class are used teach relevant topics that are covered on the midterm and final (which are really hard)",
    "Professor Thornton is easily one of the best CS professors at UCI. His lectures are clear and thorough and he has a good sense of humor. However, his lab assignments are pretty difficult and they do take a long time to figure out. In addition, his exams are ridiculously hard. Luckily he accounts for this with a big curve.",
    "Focus on so many little things. The projects are crazy long and complicated. Very difficult!",
    "Alex is one of the best professors I've ever had. His lectures are amazing! He is good at explaining things. He clearly knows where we need to get in this class. You can learn a lot from the projects he assigns. It's not hard to get a good grade as long as you really do your work. He's good at what he does and can make you love what you learn.",
    "Favorite professor thus far at UCI. I highly respect and recommend Thorton.",
    "Not only does he know his stuff he knows how to transfer that knowledge to his students. Great lecturer, solid examples in class. Exams are detail driven. Exams are not so much about your ability to program (that's tested with projects), more if you understand the minor details about the language.",
    "Incredible professor. You definitely need to work hard for this class though, but thorntons enthusiasm I think makes his students enjoy the work enough that they'd be willing to spend time and effort on it. Huge curve at the end too, the final was very hard, I got a D but still ended up with an A in the class. An 83% overall grade was still an A.",
    "Similar with grading and organization as ics32. Thornton does his best to make lectures interesting. If you miss lecture, notes are online. Projects are difficult but doable and you get a good amount of time to complete them. The midterm and final are super hard (averages were 50-60). But the curve was really good",
    "As in ICS 32, Thornton is an excellent professor for ICS 46. Lectures were clear and engaging on fundamental data structure concepts. The projects were interesting, mixing both implementation and real-world applications of data structures/algorithms. Exams can be somewhat difficult/tricky - very conceptual with little C++ coding. And curves well.",
    "Go Boo! Thornton's very informative live coding, along with detailed notes online, will ensure that you'll have all you need to do the projects. If you're coming in as a new programmer like many, you'll be in good hands. He teaches great coding practice, and the projects are just difficult enough to be good mediums to apply what he teaches you.",
    "A real genuine professor that understands the student's to a very great extent. His lectures were really helpful towards his programming assignments, and he makes sure to make each lecture as lively as possible. Missing lecture isn't that big of a deal, since he posts his notes online, but I find that it's best to read the notes no matter what.",
    "Like in ics 32, his lectures were conceptually great. Unfortunately, he sometimes took too long and had to rush some things during lecture, and wasn't as good as in 32 because of this. With this drawback, he's still really good. I would recommend him, but you need to make sure you stay up to date or else you will fall behind.",
    "An eccentric and warm-hearted person who makes his intentions clear with his teaching. Class is reasonably difficult, and guy gives good lectures without making you fall asleep.",
    "Thornton gives AMAZING lectures. He live-codes in lecture from scratch so you know exactly what he's doing. He also posts his lecture code online, along with very detailed information about the lecture material that day. His projects get progressively more difficult, so make sure you know your ICS31 concepts. Also, be prepared for his dog, Boo.",
    "I know a lot of people say this but it's true it is a HUGE step up from ICS31. The projects and midterm/final are a lot harder and really require you to know your stuff. He's a good professor, very engaging and clearly knows what he's talking about. There is a generous curve too.",
    "Thorton was easily one of the best professors I've ever had.",
    "Alex has fantastic and engaging lectures. Computer science has never been this interesting before.",
    "Thornton is very popular and extremely knowledgeable. His projects are doable. His exams are challenging and tricky. He does not pass back exams, so you cannot learn and study from them-- which is the only complaint I have about Thornton, because I, for one, learn a lot from my exams. Huge curve at the end of the course.",
    "Top notch professor. Speechless. You will look forward to going to lectures!",
    "Professor Thornton is a great lecturer and, at least from what I have been able to gather, always has well thought-out courses. Yes, the programming assignments are rather difficult and frustrating at times, but you do learn a lot. Beware of his tests. They are very difficult. But this class is curved and the curve is amazing.",
    "Thornton is a brilliant professor - his lectures are insightful, informative, and entertaining ; you won't be bored. The projects require a fair amount of work but are fun and definitely interesting. His exams are difficult, and contain conceptual and coding questions. However, he curves the class generously at the end. Boo and him are great!",
    "Thornton's lectures manage to be genuinely funny and interesting at the same time. He emphasizes his labs over his tests, because he knows just as much as we do that CS tests are kinda bullshot, and he mostly curves them out of the overall grade to make sure that the majority of the people will pass, or about 4/5 of the class in my case.",
    "Labs are doable and fun(it depends on you. For me, they were easy but my peers didn't really love them). Exams are tricky. A lot of readings and practice to get concept. Very good and enthusiastic lecturer.",
    "His lectures are important because concepts he mentions in class come up on the midterm and final. The midterm and final are tricky including matching sections as well as code and concepts. He curves pretty decently. The labs are fairly difficult so start early. Lectures were amazing, really great at getting you into the subjects.",
    "The best professor.",
    "Great professor",
    "Spends most of the lecture talking about his dog. 10/10 would take again",
    "Written tests may have a few tricky questions so make sure to study the notes. Keep procrastination to a minimum on programs, especially when it comes to anything Othello. He talks about his son/dog Boo a lot, but you'll get used to it.",
    "I kind of like him, but at the same time I kinda don't. He is definitely a passionate and helpful lecturer, but he can go on talking about irrelevant things sometimes. He also types really fast so it's a bit hard for me to keep up during lectures, however, he is still a good instructor. The labs are a huge jump from 31, and they are pretty hard.",
    "Thornton's lectures were very interesting and you don't have to take notes since he posts them online with comments. This class took a hood portion of my time but if you don't procrastinate on the labs then it's not bad at all. The labs were awesome and graded fairly! Read his notes very carefully. He asks questions about little details from notes.",
    "Pro. Thornton is definitely one of the interesting and responsible professors I've met. He can always give us inspiration especially at the beginning of our CS study. And the final grade turns out great even if u feel bad about final.",
    "HUGE jump from ICS 31. However, coming from someone with no experience other than that first class, I found ICS 32 to be manageable and rewarding. The projects are long, but interesting; make sure you don't put them off to the last minute! Thornton is a great and hilarious professor, I would definitely take another class with him (and Boo!).",
    "Energetic, hilarious, and clear. I enjoyed going to the lectures, despite their length, and this was due to Thornton. I found the class easy, but I've been a bit ahead of most classmates. Often talks a lot then codes a lot at very end, but otherwise very nice lectures. Focused on bigger picture. First 2 projects are partnered, next 3 aren't, (yay!)",
    "ICS 32 is that attention-wanting child that takes too much of your time and you start to neglect other children (classes) if you're not the strongest in coding yet. It's a big jump from 31, but Thornton is a very energetic and helpful guy. You're forced to take little parts of notes and apply it to projects. He's a decent professor, but very tough.",
    "Let's be real. ICS 32 is a giant jump from ICS31. This is going to be very hard compared to what you are used to. However, Alex does a great job at teaching this course and helps you get ready for real world applications in programming. Definitely attend every lecture and alway start your projects ahead a time! He's entertaining and clear.",
    "Best college professor I've had yet! Lectures are long, but he keeps you entertained with a big personality and funny jokes.",
    "Great professor! The projects are really cool and fun, and his lectures were the best.",
    "After taking Alex for ICS 32, I was excited to see him again for 45C. Nothing has changed, great lecturer, explains things clearly, and the lecture notes online are easy to follow. Projects were a bit strenuous because it's C++ and the tests were highly conceptual, making it pretty difficult. Nonetheless, Thornton is awesome! So is Boo.",
    "Thornton is one of my favorite lecturers. He starts his code from scratch and explains everything clearly. If you focus for the full 80 minutes, you'll learn a lot. Labs are difficult, but that's because C++ is so annoying to work with. Tests are even more difficult, but he curves grades at the end so you usually only need about a D to pass.",
    "If you like Thornton, you'll like 45C. Definitely one of the tougher classes I've taken, but a ton of fun to figure out. C++ just sucks in general. I highly recommend you take this class with him, I learned a lot.",
    "I learn a lot in lecture. Haven't needed to use the textbook once. He takes very thorough notes about every topic and uploads them to the website. Freely answers questions in lecture and bonus points for being funny. Overall 9/10.",
    "Great lectures. Missing one is equivalent to missing your favorite TV show, except you actually learn something. Out of all the ICS 30 series professors, his assignments are the most practicaldown-to-earth.",
    "Excellent Lecture, but is not an easy A. You must attend every lecture and listen to what Alex is talking about to make sure you can do perfect for every project. Midterm avg. is 19 out of 26. Almost half of student may be failed this class. However, Alex is a very excellent teacher.",
    "If you're going to take ICS 46, do yourself a favor and take it with Thornton. The concepts are not easy, but Thornton spends a lot more time TEACHING you than telling you to go read the 1000-page-long notes (cough Pattis cough). His notes are thorough, but aren't online, so attendance is mandatory. The tests are really hard, but fair (take notes!)",
    "I don't really understand why he's praised. His ics 32 was fine back then, but his ICS46 is pretty bad. I barely learn anything from him. He just goes over the basic concepts during the lecture and pretty much goes \"Oh here you go, survive well!\". His lecture is confusing and he goes around the bush, yet he doesn't provide any extra study material.",
    "I'm currently getting close to wrapping up my third class taken with Thornton. I'll admit, his class is certainly not an easy A and the tests are pretty difficult. However, all the credit that might bring your grade down on tests can reasonably be made up by doing well on projects. He teaches in a very life-applicable way, which I value greatly",
    "You learn a lot in this course. Make sure you understand EVERYTHING in the lectures and don't procrastinate on the labs. They will probably take you longer than you think. Make sure to go to lecture too so you know how to do the labs correctly, instead of your own way. Overall he seems like a nice guy.",
    "Best professor teaching me since the beginning of this school year. His lecture si truly interactive and interesting, partially because of his lovely Boo. Humble, humorous and helpful. Lab work spends up plenty of time, and yet sometimes the exams do go tricky. But nice to have it curved. Great pleasure to have him taught me ICS 32.",
    "He is a great lecturer. He is definitely really helpful and responsive, such as in email. Just spend time doing the projects and make sure they do everything you're asked, and you'll get full credit there. Study code examples in full detail for midterm and final, as that is what will help because they are hard. Curve saved my grade.",
    "Be sure to read the code examples and internalize them as soon as they come out, work on the lab little by little and you'll be fine. Do not wait until the last day, it never works, these assignments require your full attention. There is a generous curve, my D+ is a solid C. Also be sure to attend lecture, I missed a final question by ditching.",
    "A very enthusiastic lecturer. Explains the materials very clearly and keeps you engage in lecture. Have a clear grading criteria, tells you exactly what he expects from you. The midterm and final are fairly difficult, make sure you know your subject well enough. However, the curve is pretty generous at the end.",
    "Alex is an amazing CS professor, probably one of the best in the department. His lectures are very enthusiastic, but can sometimes be a bit repetitive. Projects are very interesting, but challenging. Midterms and final were tricky. Alex also works as a software engineer, which made me learn more about the real world, not just programming.",
    "He makes a fundamental programming class really funny and interesting. Quite an energetic personality that makes you look forward to go to class compared to other CS courses. You HAVE to understand and do all the labs in order to do well on his exams which that are tricky. Talks about how boo likes it doggy style all the time for some reason o_o",
    "Very enthusiastic and very fun to listen to! He's a very responsive professor and gives very uplifting speeches. Projects are very hard and require a lot of time. The midterm is very tricky as well. However, there is a generous curve.",
    "He's an excellent professor. He has an uncanny ability to keep you entertained, despite him being on topic. He goes off topic plenty, and they are some fun spiels to listen to. If you EVER need help, email him or go to his office hours. He's incredibly helpful and quick to answer. Don't be worried about the class. It's not hard if you work hard!",
    "Okay. Thornton's classes usually aren't that easy, and 45C is no exception. It can be tricky getting used to C++. His assignments are also challenging. However, it should be worth noting that he is one of the most helpful professors EVER. His office hours are the best, and his assistance will often save you. If you can take 46 with Thornton, do it.",
    "This is my second time having Thornton as a professor, and while many of the things I have said in the past remain true, one thing is for certain: his exams are very tricky. Regardless, he is a great lecturer and his projects are relatively interesting as always. It is no wonder that he is one of the most popular ICS professors at UCI.",
    "He's a cool professor and he really wants you to succeed. He has a \"one-time, no questions asked, no notification needed two-day late policy\" that is really helpful for that time when nothing is going right.",
    "He's a good professor. He actually codes in class to show you how things work and it's really helpful. His labs are pretty easy but if you need help don't be afraid to ask for it. He's a nice guy and funny. He talks about his dog a lot but I didn't mind that. I wish he was teaching ICS 33 instead of Pattis.",
    "Thornton's lectures are hilarious and interactive. He's a real chill, go-with-the-flow type of guy but you definitely learn a lot in this course. Yes, you might have a mild heart attack when you see your first midterm score but the final curve of the class is awesome.",
    "My third course with Professor Thornton (ICS 32, ICS 45C, and ICS 46) and Thornton has continued to the be amazing lecturer he is. Extremely charismatic. Very clear and animated during his lecturing. Extremely professional and prompt at replying to emails. Exams are challenging and ICS 46 is very different from other Thornton courses. Study hard!",
    "This is my 3rd class with Thornton and like always Thornton has been the same charismatic and very intelligent lecturer he is. 46 is a lot different then 45C and 32 keep that in mind. Very concept based. The labs are really hard and the midterm/final were very hard. Study hard and you will pass. Thornton is the best at responding to your emails!",
    "Great professor! Very passionate and humorous. This class was challenging and time-consuming, but it really brought up my interest in CS.",
    "Alex was an amazing professor. I never was bored in his class, his projects were challenging but manageable, and best of all he is a super funny and nice guy. Take the class, you won't regret it!",
    "Possibly the best teacher I've had so far in UCI. I've had him for three classes thus far, and he has been crystal clear throughout in his teaching. Passionate and brilliant.",
    "Professor Thornton tries his best to make a 1.5-hour programming lecture as interesting as possible... but with mixed success. However, he is a very resourceful instructor and will respond to any questions you throw at him in a timely manner. The class itself is not too difficult so long as you understand all the information.",
    "If you read the instructions you can basically ace the projects. He basically spoon feeds you the project core codes during his lectures. Final and midterm are easy if you know how to do your projects.",
    "He's funny, intelligent, and a great lecturer. This class is a HUGE jump from ICS 31 and the projects do require a lot of time. Midterm and final are difficult, so you really need to know your stuff. The curve is generous, but it will not save you if you slack off. Many people end up failing because they underestimate this class' difficulty.",
    "He's an excellent lecture, but this class is a HUGE jump from ICS 31 and the projects DO require a lot of time. Midterm and final are difficult, so you really need to know what you're doing. Many people underestimate the difficulty of this class and end up failing - do not be one of them. Curve is generous, but will not save you if you slack off.",
    "Professor Thornton is quite great. The course, in my opinion, is about exposure to Python's library, and finding the right tools to solve the problem. Professor Thornton does this with interesting projects, and entertaining class meetings. I highly recommend him, just make sure you don't wait till the last minute to do the work.",
    "Good teacher overall. Believe what everyone else tells you in that this class is a leap from 31 in terms of difficulty. You need to know even the briefly talked about concepts like the back of your hand. The labs are also fairly challenging but doable and rewarding. Thankfully he curves the class at the end very generously. You'll learn a lot.",
    "Great sense of humor and fun lectures. However, his exams are no joke-- make sure you REALLY understand the concepts. Code examples on his website are useful, but I'd advise you to attend lectures to know what he emphasizes for tests. Also, beware: even if you breezed through ICS 31, you may struggle here. It's a steep climb in difficulty.",
    "Alex is a funny teacher. He definitely knows how to make fun out of himself and make his lecture vivid and interesting. However, it's really hard for you if you are not that interested in computer science. Labs will kill you if you procrastinate. Midterm will be much harder than your 31 final. If you love cs, take it, or just find another direction",
    "He does not update his website and notes on time. Besides that, he is an interesting teacher.",
    "The class was really challenging, but in a good way. Things we learned in that class appeared really applicable. I would love to have Thornton again for future classes. Since Thornton is a part-time software programmer, he's one of the most knowledgeable professors I have had. The labs were interesting, tests difficult. Definitely study.",
    "/sobbing because I got a C and have to retake/ BUT he was a good professor. He taught things very well and surprisingly I don't mind being in this class again. It'll help me get a better grasp of the concept. The class is fairly difficult, but you will definitely learn something. He also loves his dog, Boo.",
    "Clear speaker, interested and fun professor. Knows a lot about computing and creates an enjoyable and helpful learning environment. He sponsors independent work, meaning labs were a bit challenging and fun to complete, but requires a lot of effort from the student. There is a huge gap between ICS 31 and 32, so be prepared!",
    "His class is definitely challenging. Do NOT procrastinate on the labs, or they will end up killing you. This class definitely consumes most of your time. The midterm and the final were no joke. You need to know your stuff.",
    "Very good professor. He is a passionate lecturer with lots of funny jokes. He focuses more on practical teaching rather than theory. He's a professional software developer in the real world so he applies that to his teaching. His labs are very hard but very fun. You will learn so much.",
    "Prof. Thornton is DEFINITELY a pretty difficult CS professor. His projects are no joke and require a lot of outside research, refined logic, and TIME. Don't start his projects late, because it's so easy to underestimate just how much time a project will take. His lectures are very informative, and he's smart and knows the CURRENT computing world.",
    "He is an amazing professor and is really passionate about the subject. So long as you pay attention and put in the work on labs he assigns, he is easily one of the best computer science professors at UCI.",
    "The best professor I've had in CS so far. This guy just outdone my number 1 teacher in terms of quality. Very approachable and explains the material very very clearly. His tests were challenging since they require critical thinking to solve the question. I look forward to my next encounter with this professor.",
    "Thornton is an interesting professor. He's kind of odd but he's humorous and really great at explaining things. He sometimes goes off topic a bit but he still does a fairly good job at teaching and explaining the topics. His tests aren't that difficult if you pay attention to his lectures.",
    "He is a very entertaining professor. Sometimes he goes off on tangents but they are usually quite funny. He explains things well.",
    "Projects were very difficult but he is an extremely fair grader! I got a 69.9% but he gave me a B-. Lectures were ok, mildly interesting",
    "Thornton teaches concepts clearly but the details are sometimes lost. Excellent teacher overall, tests are hard, labs are fair and interesting (quite challenging actually). Got a C in the class but tried really hard and learned a lot...definitely worth the experience.",
    "Alex is easily the best teacher at UCI. If you want to understand the material in a way that makes it interesting, keeps you engaged, and sometimes even makes you laugh, take one of his classes. His understanding of the material is flawless and is only surpassed by his ability to explain it.",
    "Had him for both ics22 and cs141. Extremely smart & helpful; he makes it clear that he loves to educate. Probably the best professor I've had at UCI. If I've ever met anyone who deserves an honorary PhD, it's Alex Thornton. He is smarter than many of ICS' tenured professors (sad). Tests can be difficult, but DEFINITELY worth it.",
    "If Kevin Smith taught ICS, he would be Alex Thornton.",
    "Had him at COSMOS, he was fun.",
    "Best ICS professor ever! Extremely helpful. The assignments are challenging but you learn a lot in any of his courses if you put forth the effort. He's very enthusiastic about the material.",
    "By far, one of the best ICS professors at UCI! Super approachable, thorough, and clear. I wouldn't characterize his classes as easy, but you sure get a lot out of them. He really wants to make sure the students understand the material. He's got a great sense of humor and remembers what it's like to be a student. Take his classes whenever you can!",
    "Great teacher. Knowledgable. Extremely available and willing to help.",
    "Best professor in ICS, period! Easy to understand lectures, very helpfull! Always answers questions, full of energy during all classes.",
    "For freshman just starting in computer science I,m going to tell you to take all your intro classes with Thornton if you can. He tries to keep things interesting and will help you if he can. The only thing is if you ask him about something you should know already he can be quite condescending.",
    "No Comments",
    "Easily the best professor I've had at UCI so far. His lectures can sometimes be boring (cause of material) but he does a good job keeping the students interested. Very enthusiastic about the material and wants his students to learn the material. He is very helpful during office hours, class, email, and through newsgroups. Highly recommended.",
    "Very understandable and clear. A+++",
    "He's a very clear but fast lecturer. He doesn't use power point presentaion or slides in the class. So if you are not a native English speaker, you'll probably have a hard time keeping up with his fast paste trying to understand and maybe take notes in class. His exams are very hard. However, he's really patient and out there to help.",
    "thornton rocks. he's obviously into teaching; makes the class fun; and he is very approachable in office hours, if you are having trouble he will work with you. likely the best teacher ics has. (so far anyway)",
    "I must say that this is the best professor I've ever had at UCI. He's very enthusiastic and funny in class. The best part is that he's responsive. He responds to all his e-mails promptly and he's very helpful during office hours. Sure the work may not be easy, but you'll get a lot out of it.",
    "Great prof! He's very helpful and knows his stuff. Funny guy too!",
    "Great teacher. He is very helpful & tries very hard to make the class understand things. He drinks too much iced tea. The java portion of the class was very easy, the scheme portion was mildly challenging.",
    "Thorton is the best!!! his lectures are funny/you learn a lot.. he knows his stuff.. and i lik eth eway he presents everything... his labs on the other hand are wow.. very veyr hard... then again i always started the day it was due.. and spent like 8 hours on it.. just START EARLY on labs..",
    "22 is easy, 141 is a bit more difficult but Thornton will make you laugh and explains the overall concepts very well. Makes ICS fun! Labs in 22 are a joke (less than an hour a piece) but labs in 141 are loooong but not too hard.",
    "He's really knowledgeable and nice. His projects are really challenging, but he tries to be funny in lecture, which wastes a lot of time he could be using to make the material he covers more relevant to what is on the exams",
    "This guy has to be my favorite ICS prof so far. He seems to be one of the few who cares! Unlike some ICS profs, he does NOT have tenure and yet I've hated every prof that does. Coincedence&#63; Absolutely not. Plus, he does have a good joke every once and a while",
    "Great instructor - classes require a lot of hard work - but he is always willing to help. If you want easy classes, you shouldn't be in ICS anyway. He'll work you. Labs are tough, but you'll be all the better for it. You WILL know Java inside and out when he's done , but it will make life easier.",
    "To me, Prof Thornton's only pro is that he's not Jacobson. His con is that due to the organization of units stipulated by the ICS dept, the 2X series of classes have an ungodly amount of labs and exams. Tests were terrible.",
    "Took ICS 141, ICS 142. both very challenging courses with the very best instruction. Assignments and exams are difficult but fairly graded. Alex is very approachable and is always willing to spend time on clarification. Never a dull moment.",
    "Knows what he's talking about, but has a tendency to ramble. Very vague when answering questions, not very helpful. Unfortunately, he's the only ics22 teacher around..the labs are a pain in the ass.",
    "Probably the best professor I've ever had. The first thing I do when looking for courses is check if he's teaching anything I need to take.",
    "One of the best ICS lecturers.",
    "one of the best teachers i have had in my four years, hands down, all departments included. flawless rhetoric, entertaining, and always clear with his explanations. this is for any of the following: ICS 21, 22, 23, 141, 142, and 80",
    "good teacher, but labs and exams are surprisingly difficult. is very helpful if you go to his office hours",
    "Good, cool professor who really wants to help student to learn. At first he is not that great, but he is getting better now. Just do your lab all the time, then you should be alright.",
    "No Comments",
    "Best teacher @ UCI!! #1",
    "His multiple choice tests are hard... His labs are also long. But the labs are managable if you get his help. He is very willing to help any student.",
    "Awesome lecturer.. one of the best lecturers I've had in across any of my classes.",
    "Great teacher, like others have said, project are a bit tough, but very douable and he helps a lot on the newsgroup. Keeps your interested and is easy to follow in class.",
    "Cool guy, lively. One of the classes I never missed and stayed awake in. Take your notes and you won't need the book. Projects are challenging but usually interesting. Tests are pretty hard. Learn your O-notation!! haha",
    "my biggest supporter and most trusted advisor",
    "Good teacher, does a good job of explaining things so you can understand them, and continuously keeps you interested by telling stories. Had him for 22 and 23 , and would say overall a good professor, programs can be hard, but are doable.",
    "Had him for one of his first quarters at UCI. He was great. Very lively lecturer. One of my favorites.",
    "Thorty boy!",
    "good teacher, pretty interesting. The projects can be time consuming and the tests can be somewhat difficult, but overall not to bad.",
    "Pretty interesting teacher. Always saying this like since you pay a lot of money to study here.. and since I care about your education.. blah blah blah. Explains concepts clearly. Honestly,ics majors ya don't have much choice when you take 21-23",
    "Younger than the other professors and makes witty remarks.",
    "No Comments",
    "he teaches the class clearly and if u go to lecture then dont need the book",
    "He doesn't like the Clippers! If you love the Clippers, do not take the course...he is a Clipper hater. Otherwise he does a pretty good job teaching and keeps you interested by going off topic all the time. Tests are easy, projects are hard, good teacher!",
    "if you tend to fall asleep in class dont take thornton. you have to listen to his lectures and write everything down cuz his notes are like chicken scratch and he doesn't write half the stuf fhe says down.",
    "THEE best ics teacher on campus! He makes lecutures interesting too.",
    "Elective class, with long hard labs. Funny Guy though.",
    "Very funny! The one and a half hour with him is never boring. Always does his best to help students. Projects are hard, but fair.",
    "No Comments",
    "He ain't that great. Well, maybe the best around...but not THAAAT great.",
    "No Comments",
    "I'll never forget this class, hehe.",
    "the one before this was my messup, he definitely gets better scores",
    "Great ICS lecturer"
]
