[
    "Easy teacher, but has no clue what he is teaching.",
    "Professor Frost holds pretty boring and mediocre lectures, but his lectures help out if you pay attention. However, he is very picky with answers to homework assignments and exams. His exams consist of material from lecture and the book. But all in all, you should not be too stressed for this class.",
    "Frost is a really great lecturer. Just listening to him talk you can tell that he really enjoys teaching the class and talking about Informatics. He does a good job of explaining the material. The class itself isn't great, I found the material pretty boring and it can be vague with difficult tests, but Frost himself is very good.",
    "This is a fun class. A little time consuming, but fun. Lectures are extremely optional because this class is essentially the video game version of ICS 45C. It's pretty easy. And some of the projects and programs are pretty fun to mess around with. Tests are easy too. Easy \"A\" as long as you're willing to put a little time into the projects.",
    "Professor Frost was interesting and funny, but his grading was tricky. You better read for the exams.",
    "Overall, Frost is a nice guy, is fairly interesting when it comes to lectures, and most certainly has a distinct sense of humor. The subject matter, on the other hand, can feel boring and sloggish. The class itself is quite easy, only consisting of 3 exams and 3 homework assignments, and he records all of his lectures and posts them online.",
    "Professor Frost is a great teacher. He explains what he wants very thoroughly and what will be on the test are questions that will not catch you off guard because he literally gives answers in his lectures if you pay attention and attend. Just do what he wants, which is very little, and you'll receive an A. I love him so much I had him for a year.",
    "Horrible Professor Irrelevant lectures pointless test questions and lots of reading. Not a helpful person and enjoys giving students bad grades. Convinced he is best person to walk the face of the earth",
    "Worst professor I've ever had. He makes you read long articles that are barley related to the topic of the class and spends most of the time talking about something that isn't the main point of the article. When grading either a test or an essay he looks for key words he expects. If you use a synonym to the word he wanted no credit.",
    "The entire CGS major here at UCI is a big joke, especially since it's run by Frost who doesn't even have a good understanding of modern games honestly. You're stuck reading about articles from the 1980s and what makes video games \"art\". Why not just list this course under the Arts huh? At least you're combining two equally poor curriculum",
    "Vague course with unclear instructions and expectations. Weekly quizzes were ridiculously nitpicky, often requiring exact wording. What he wanted from the assignments was also hard to understand because he was always so vague, especially the third one. Discussions were useless, and final contained a lot of random vocab we never covered in class.",
    "Generally easy course with very little of workload. Mandatory attendance for discussion sections for grade. Weekly quizzes, if you do the assigned readings you will pass them. Midterm and final were mostly all based on readings with some pulled from lecture. Three assignments that were somewhat vague. Very helpful in office hours.",
    "3 assignments, 12% each. 1st assignment was unorganized, 3rd assignment was vague. Expects you to memorize little details word for word from the reading assignments. Everything covered was too general. I feel like I learned nothing in this class. Hopefully next time he will use a textbook.",
    "Material covered is useful. Quiz and midterm were ridiculously hard. Memorize everything in the readings. Including small diagrams. Studied over 10 hours on midterm. Review questions are nothing like the midterm at all. Emphasis on minute details. Stupid class with stupid expectations. I hate classes with tests like these.",
    "Go to Lecture! His assignments are very broad and unclear. Other than that, his midterm and final are open notes (though it didn't help much).",
    "Go to lecture..No book used",
    "Sets the standard for Game Professors",
    "Reasonable grader, tough assignments. Somewhat challenging exams but not impossible. Interesting class but lost interest after a while in lecture since this past quarter it was a 3-hour lecture. Overall good class!",
    "Very reasonable grader, reasonable workload, and a fairly decent lecturer. His material may not always seem relevant, but it is important; attend all lectures, read all assigned readings, and do all of your assignments and you will pass this class easily. Extremely helpful, as well, and the structure of the class encourages creativity.",
    "Not hard to get a passing grade at all. However, the grading method is mainly based on opinion. This applies to the ICS 52 course as well. In other words you're not really learning anything. There is 1 benefit I got from CS 113 though, and that is networking with people.",
    "Frost has a knack for making lectures lively, even if the material is boring as hell. His tests, projects, and homework tend to focus on practical applications of the material, rather than memorization of the theoretical definitions. I wish he made the class harder, because the median class scores were always in the high 80s.",
    "He's a pretty interesting lecturer. Games as Art, Culture, and Technology is an easy class, so long as you come to lecture and discussion and everything. Note: it is particularly easy to not come to lectures for this class since they sometimes don't seem relevant.",
    "Fun class!",
    "This was a project course, so lectures were generally meaningless. A few were mandatory for presentations. This course was sweet though. Teams of four. A lot of freedom in creating a game. I learned a lot, mostly through independent research, and it models a real job better than most classes. A lot of work, but fun and interesting!",
    "This professor provided a great first look for our class on the entire software process model. Did a good job of introducing several software models as well as allowing us to apply what we learned using a system we had to document, implement and then test. The professor is very honest and easy going guy who keep class feeling relaxed.",
    "Just one of those classes that lacked direction. The projects were fairly interesting, but you have to remember the reading pretty well for quizzes and tests. Professor Frost seems to know the material well, but it was hard to grasp what the class was about.",
    "Frost is a really great professor who brings a lot of real-world experience to the classroom. Lectures are interesting and relevant to working in industry. Some labs are more relevant/interesting than others, but I feel that I got a pretty well-rounded sense of the various tools out there. Go to lecture and this class is an easy A.",
    "He is pompous and thinks pretty low of the students. He makes that clear when he grades your papers. No constructive criticism. He criticizes your paper for the sake of criticism. Not a great teacher as some would lead you to believe.",
    "No Comments",
    "He taught this class for the first time and it was horrible. POINTLESS lectures and irrelevent midterm and final = horrible class. He might be better when he teaches 52 or another class, but in this one it was horrible.",
    "No Comments",
    "I graduated but i can say that he was one of the top professors if not the top professor in ICS. He actually cares and will give you as much time as you need to help you learn not just get a given grade.",
    "Treats students with fairness and respect. Takes teaching seriously.",
    "Great Lecturer, his assignments weren't too hard though they took a while to do. Tests were also very fair and drew more from lecturer than the book. He has work experience, and taught this class like 10 times...so its very well grounded. He isn't too great at 1-1 live communication though.",
    "he has an easygoing likeable teaching style but this does not necessarily extend to one on one contact. like the other poster said he doesn't seem particularly interested in students' particular situations. all in all though he seem ok.",
    "lectures are useless. The projects and hws are challenging but haven't been changed from the previous quarters. He's not really nice or easy going on difficult situations of students.",
    "He is an interesting professor and teaches his courses really well. He has very easy-natured and is witty. Lectures are definitely worth going to (I'm usually the type that skips lectures, so thats saying a lot). Assignments and tests are somewhat challenging but is very helpful with reviews, emails, etc.",
    "Honestly, his sense of humor matches mine. It's wierd, but he cracks me up. His assignments were tough and time consuming, but I understand that that is the nature of the course. I took the same class w/ another professor and it was much less pleasurable. I recommend him over many other professors, by a long shot. Take him if you can.",
    "He is a nice guy and all, but his lectures are not very helpful. The projects are awesome, but the weekly homeworks get to be a bit much.",
    "Best ICS class I've had yet. Weekly hw assignments keep you on your toes and projects are pretty exciting. Top 8th of the class gets an A, which makes you work harder for the grade. He's pretty witty too.",
    "Frost is nice and is very clear in his lectures. I over-studied for the exam, as they were exactly as easier as the pratice ones. Be very careful with the style that they want the answers in! Otherwise he's a good prof who will teach you &quot;hands-on&quot; AI with projects.",
    "Very interesting professor. Worth taking 8am class for.",
    "pretty good teacher. Tests aren't too hard and explains stuff well.",
    "It is a decent class to work with. Most of the grade come from labs, so make sure it works. He is clear and precise about what he wants, so do ask him if you have questions. Enjoyable to talk with in front of class or in person.",
    "Very good teacher. Interested in teaching and helping students learn. Clear. Concise. To the point.",
    "Easygoing professor.",
    "Actually had him for 4 or 5 classes, great professor. Interesting projects, fun lecturer, not too tough.",
    "First time teaching h23...but he is an awesome teacher...projects are the most interesting i have had...he teaches interesting topics along with course material...midterms are relatively simple so long as you do your work...",
    "Made AI very interesting. Too many homeworks, but I learned a lot from them.",
    "Great teacher",
    "Willing to comprimise to make sure that you understand everything. Great teacher",
    "Just an overall great guy and teacher.",
    "The sexiest professor ever!!!!!!!!!",
    "It's so hard staying awake in class",
    "Very clear lectures, very nice guy.",
    "No Comments",
    "Not as good as Thornton",
]