[
    "Professor Mark is a pretty good professor. Pretty clear with stuff, the quizzes and exams are from the slides so you're chillin. She talks about her summers at Microsoft ALOT and it gets kinda boring so prepare for that lol.",
    "avoid this teacher/class if you can take something else. the workload is A LOT given that you have to submit a summary (more like an analysis..) each class period. the grading is tough on those articles too. 16 page readings and you have a single spaced page to cover all the points along with your own outside source for analysis. it's ridiculous.",
    "Article summaries 20% Write-up on past/future perspectives 10% Midterm exam 25% Final exam 35% Class participation/attendance 10% 1 page (SINGLE SPACED) summaries of 12+ page long readings due EVERY class, even midterm week. 3-4 page (single spaced again) essay. Calls randomly on people to present EVERY class on the readings/summaries.",
    "Tests are based on: 80% what she says during lectures, 20% readings. Lots of assigned readings. Very bad lecturer, barely knows how to use a computer but teaches about the Internet & tech, ironically enough. 2 tests, weekly HW requiring a short 2-page paper + 1 project at the end + Pop quizzes. Boring class, bad at teaching, takes effort for an A.",
    "i bombed the midterm and aced my final and did alright on the pop quizzes and got a b+ as long as you read, you pass. she takes attendence towards the end of class and those are part of your grade so just stay until then and leave afterwards. her slides are online and are the exact same thing as the readings assigned.",
    "She gives pop quizzes weekly that are based on the readings she assigns each week. She pretty much repeats what's on the PowerPoint during lecture which she posts online. Her tests are based on lecture and the assigned reading so be sure you know your material. If you need help, you can always ask her and she'll be happy to assist you.",
    "A lot of work, but great professor.",
    "I had her for ICS 3 and I thought she was a good professor. Her lectures can sometimes get a little boring, but she's really nice and easy to understand. Her tests are based mostly on the readings she assigned so the class is pretty easy if you just read the materials.",
    "Great teacher! Very interesting person to talk to. I really enjoyed the class.",
    "Pretty easy class. Read and study powerpoints before tests. I vouch for the previous review saying she is technologically challenged. Did not know hot keys for copy and paste. Blamed the lack of knowledge on being more used to MacOS (which also has the hotkeys).",
    "Mark talks alot about nothing, and has a superiority complex. She doesn't know as much as she thinks, and for a computer science teacher, she sure doesn't have a good handle on computer usage. If you cant even work the projector or youtube without help, you dont have any business being a computer science professor.",
    "Great teacher and speaks clearly. Presented interesting information and the projects and tests werent all that bad. Not the best class I ever took, but I did really enjoy it.",
    "She taught one of the best ICS classes I've ever taken. I very much was interested in the content of the class.",
    "She will let you get a hand on real life IT experience. She has a vast knowledge of the industry that she is working in. Her tests are not hard. The only hard part about this class is you finding a suitable teammate for the project. Other than that, its a very interesting class",
    "She's strict and tough, but a great professor. If you attend most lectures and participate in class, she'll like you. 132 requires a lot of reading and 1 big paper, but it's not hard. 135, bi-weekly assignments due, just like any other project course",
    "Tests are not clear and she expects very precise answers... they are a major part of the class... there is also ALOT of work in this class... daily writing assignments, each ranging from 3-10 pages or more.",
    "overall not bad. gives a lil too much work at times, and is very picky when grading tests. but work isn't too hard.",
]