[
    "Prof Kay is very kind and straight forward. His lecture are a bit boring but he always has time for questions. He's patient with everyone and the class is quite easy. There is pair programming for every project so be ready for switching partners every week. Easy A if you can do the basics of coding.",
    "Professor Kay does a really good job of introducing Python, especially since I had no prior background to coding. The assignments were fairly easy, but they do get more challenging towards the end. He does release previous midterms, so use those to study as well as the weekly quizzes. Overall, this class is very manageable.",
    "Professor Kay is awesome. ICS 31 is an intro course thus it is not a hard one. Be sure to ask questions when you don't understand any lab assignments and remember to REALLY do the quizzes. Study the past midterms and you'll be fine.",
    "Professor Kay is awesome.",
    "That was an easy class",
    "Easy A, amazing professor",
    "His teaching was very easy to understand, and the midterms aren't difficult if you study the previous midterms he posts. The labs were difficult towards the end of the quarter, but nothing compared to what you'll see after ICS 31. However, he's a great professor.",
    "Overall explains concepts well enough. Midterms are very easy because they are almost exactly the same as the previous midterms, which he posts with answers. Quizzes are also easy because they come with an answer key, though you should do it without the key if you actually want to learn. Lab is a bit harder, but not impossible. Would take again.",
    "The class is pretty boring, but is easy as long as you do the work. Most of the time, the lectures and programming assignments don't correlate, but that doesn't really make the class any less easy.",
    "For an intro CS class, ICS 31 was jokingly easy. Slow pace, extremely easy exams, but forced to do pair-programming for the programs.",
    "Easy teacher. Calm and somewhat indifferent. For ICS 31, you have to *try* to fail the course.",
    "Class is ridiculously easy. Exams are way too easy, and labs can be completed very quickly, though you are required to do pair-programming.",
    "David Kay is a perfect instructor for those going into their first programming class ever. He structures his midterms and tests in a comprehensive manner, and they're heavily based on the material covered in class, in labs, and sometimes in the readings. The labs themselves are VERY straightforward, almost designed cook-book style.",
    "Really nice professor. Very patient in answering questions. Although he usually do typings, that is totally fine for intro-programming.",
    "Very easy class. Good professor.",
    "He is really an amazing professor. His lecture is really clear and he is really helpful. Grades only depend on quiz per week with credit if you did it, pair-programming projects, one midterm and one final.",
    "Easy A. Lectures available online so attendance isn't mandatory. Clear explanations of basic programming concepts so you can have no prior programming experience and still get an A. Labs are easy and can be finished within 2-4 hours per week.",
    "Material taught in class is organized but not always related to lab. Labs are the most difficult part. Pair programming can be disappointing if you are paired up with people who aren't prepared. Midterms are very easy (just take the previous exams). There are online quizzes and partner evaluations that contribute to grade too. Final wasn't too bad.",
    "Lectures are helpful, but they hardly line up with what we have to do in lab. The lab stuff is more difficult. It's also pair-programming so you have to work with a new partner each week and depending on your partner, this could be a good or a bad thing. Tests are easy and based off practice exams posted online.",
    "Helpful lecture, great professor, easy A. To be honest, you will get A only with class notes.",
    "Do yourself a favor and read the textbook in the beginning if you are a beginner to programming in Python. He uploads recordings of his lectures online, but sometimes some will run into errors. I was in his 8am class so I relied heavily on them. Study them for tests. The last program (bed and breakfast) was long, so start early if you can.",
    "Lectures felt long and boring (quiet lecture hall while he was typing out the notes). Lab assignments were fine, but they got harder later in the quarter. The two midterms were very easy (just study past midterms), and the final was easy as well (let's you bring a page of notes).",
    "I honestly learned more in labs than in lectures. His notes are sometimes really confusing. The TA taught more than he did, so go to labs, they're essential for passing. Two midterms and final are all doable. I'm new to programming, but I still got an A.",
    "Kay is a good lecturer. He will teach you the the Computer Science fundamentals. Overall an intelligent and good lecturer.",
    "Took ICS31 w/ Kay Fall 2015. Lab attendance required, forced to do menial programming problems with a partner. Only went to first 2 lectures, skipped the rest. Terrible at lecturing, changes his tone/volume spastically, poor at explaining things. Actual lab work is easy beyond belief. Tests are relatively easy (30 min) TL;DR bad teacher, easy A",
    "DON'T EVER SKIP LECTURES OR LAB CLASSES AT. ALL.",
    "pretty good lectures. Explains things really well. exams are fair. Can give you more advice besides studies.",
    "Go to lecture, learn stuff, do labs, get A in class. Tests are very easy as long as you aren't slacking. I didn't read any of the book, missed online points, and got a solid A in the class because I understood the labs well. Lectures are boring, but VERY informative, so don't miss them. Bad lab partners are common (sucks), which helps you learn.",
    "Professor Kay teaches ICS 31, and he is experienced. Labs take up a huge part of your week, so beware of that (destined to non-comp sci majors)! His attendance isn't too great, and a lot of people are missing on concepts. The two midterms and final mainly test your attention to detail, so be careful with that. However, they are relatively easy.",
    "Professor Kay is a really helpful and clear lecturer. He truly wants you to succeed so go to lectures. However, if you can't, it's okay because he sends you emails of the lecture notes and replays. The labs are pretty doable, but get progressively harder and you might have to spend a lot of time on them. Overall, a pretty easy class.",
    "Enjoyable class! It is extremely easy to get an A on both midterms if you look over the past midterms. The final was easy too. If you genuinely try to complete the labs with your partner exactly how Professor Kay wants you to, you'll learn a lot of things that will make you think differently and outside of the box.",
    "Having Professor Kay for ICS 31 was pretty great. The class was really easy, especially if you have previous experience in coding. If you do have previous experience, the class is essentially a courter long review, and if not you will catch on quick with his lectures. You will have a lab every week with a partner, that covers the topic for the wk.",
    "Amazing Programming teach 11/10 IGN. He's papi AF",
    "He was a great professor who allowed an equal opportunity for each student to pass.",
    "Great teacher! Helped each everyone into the python language!",
    "The labs and lecture are really long. But he posts recordings online which is nice. A bad partner in lab can really put a downer on your week. Pair programming required though. Assignments are clear, but he doesn't give you a grade breakdown. Gives you a page of notes for the final.",
    "ICS 31 is an easy course for computer science. If you follow his steps during lectures, and do his lab assignments carefully and thoroughly, you will get a great score for this class.",
    "Tests are pretty easy. Get ready to spend about 10 hours per week on labs. Kay gives away lab questions in lecture. The book is a must for all newbies. Few people actually show up to lecture. All labs are done with a partner. Kay is clear with material and grading. Highly recommend.",
    "Perfect course! I have calculated that over 40% classmates got at least A- in fall 2014. Nearly the best choice for GE II! Labs are easy to finish even without your partner. DO NOT forget to do your quizzes! Good luck for getting an A!!!",
    "This is the easiest course I have taken at UCI so far. Not only because of the fact that the labs are pathetically easy, but also because of how Kay teaches. He does a very good job of easing you into the Python language. This is also great prep for future ICS courses. It might be a little more difficult if programming isn't your thing.",
    "An easy introduction course to Python; however, ICS 32 is a big jump. Lectures aren't necessary, as what Kay talks about is in the textbook. Labs are all done with a partner and aren't too difficult at all (the last lab though is a doozy). 2 midterms, which are easy if you study from the practice midterms online. Final also isn't too difficult too.",
    "I am new to computer science and that it was a good introductory class. It is about introduction to python. During lectures, Professor Kay would code which is useful for the labs, so it is useful to go to class. He is a good professor overall and very helpful if you go to his office hours.",
    "He was pretty helpful in understanding for lab assignments. Got me excited for computer science.",
    "Labs are very difficult for those who have no experience whatsoever in programming. Midterms AREN'T open note but are very easy since there are sample midterms to study off of. They're exactly like them, careful of multiple choice. Lectures are boring but are very clear. Difficult of labs easiness of lectures. Textbook VERY useful for newbies.",
    "Professor Kay is a great father-like figure perfect for me, a first year, first quarter student. He knows that you are new here and lectures, assigns, and explains accordingly. He is very knowledgable about the subject and easily answers questions. My biggest complaint is the sheer amount of examples that the lectures have, which are not helpful.",
    "Professor Kay is an excellent professor! However, the class is incredibly hard. I had to retake this class twice before I managed to get a C- . Out of the ICS 30 series, this was the hardest one. I took ICS 33 with Pattis and got an A+, but I failed this one twice. Professor Kay is overall a great professor though.",
    "Excellent professor, worth taking his class",
    "Super easy, lectures are a bit boring as the material is quite basic. Manageable weekly labs that are done using pair programming, requires little time outside of your lab period to complete. Midterm and final are also clear-cut and easy.",
    "Professor Kay is a bit boring. His lectures drag on for too long and he takes forever to explain even the simplest concepts. It is very easy though; I came in with no programming experience at all and did very well on all of his exams. Labs were a bit difficult and take a long time to complete, but they were fair.",
    "EASY. Very simple programming, although some are a little confusing. Fun. Partnered weekly projects. Lectures aren't very useful. The midterms are so simple. Not much studying required. For the final, open notes. He's always helpful and will answer any question.",
    "As long as you do and the labs (not have your partner do them for you), go to lecture, and do the practice tests he posts online, the midterms and final are a breeze. Most labs can be completed during the lab sections, so there is minimal outside work. Kay is a good professor and will teach you a lot despite the relative easiness of the class.",
    "ICS 31 with Kay was a breeze for me (had some prior programming experience). He explains things well and it was a piece of cake for me taking his class. Relatively easy midterm and final. Takes time to make sure the class understands everything and answer questions.",
    "Great professor who was fair and cared about his students. Frequently stops to answer any questions and overall a great introductory course to programming.",
    "Very helpful during midterms and exams, Also very understanding toward his students. Great class to start learning coding",
    "SUPER EASY. The midterm and final is open note, book, studyguide, old midterm (which he posts) and anything else you want to bring. The group projects are easy to BS and class isn't mandatory. book isn't necessary unless you want to make a study guide. only reason I went to class was to do other work. A for sure",
    "Class is easy, open book/note midterm and final, in class group participation, 3 group projects",
    "He's a great professor for Intro to Python. Definitely helpful and clear in presentation. You will learn a lot from him. Such a nice guy.",
    "Great first CS professor!",
    "Very helpful professor! Easy class, he really treats Intro to computing as intro to computing! Make sure to attend labs, and use those to review for the midterms and final. Very easy midterms and final if you know your stuff. Also, use the practice textbook problems. It's actually helpful to read the book.",
    "Probably one of the easier ICS professors. You can tell he's really interested in teaching the subject and making sure everyone understands. This is not the class to just try \"getting by\" in. You should really try learning the material!",
    "Very great professor. He really shows how he cares a lot about his students. Open note final, extremely easy midterms, interesting lab assignments. His lectures can drag on at times though. He's very friendly and very approachable for any sort of help. Definitely recommend!",
    "Great teacher, Goes off topic sometimes but really knows what he is doing. His midterms are way too easy. Recommended probably the easiest teacher in the 31 series.",
    "easy class. good professor. Learned a lot in his class. Take notes and quizzes are important in order to get good test scores.",
    "One of the easiest classes that I have taken at UCI so far. He sends out a recording of his lectures and his slides are all posted online. Rarely referred to the textbook. A little bit of homework and a group project that was pretty easy to BS. Open book and note midterm and final. Highly recommend this class for easy GE or credits.",
    "Lectures can feel long, and he isn't the most exciting person to listen to, but to his credit, he's not teaching a very exciting topic (in my opinion), and everything he presents he presents very clearly so anyone can understand it. Very friendly and class is pretty relaxed. Lectures are all recorded and emailed out with lecture notes every day!",
    "Tries to make a topic that is common sense seem really difficult. Lectures are very boring as a result. He also talks really weird, one second he will be yelling and the next he will be whispering, not sure why. Tests for his ICS4 class are open book open notes and fairly easy. After the first test I skipped lecture til the final, still got an A.",
    "Professor Kay is a wonderful professor. The class is definitely difficult and it's not the most riveting subject to learn. Lectures can be dry because of the content, but Prof. Kay is very helpful and good at explaining things. He's also really nice and approachable! The in class quizzes are doable but the final was a bit tough.",
    "He's really good at teaching, but his lectures are a little boring because there isn't much interaction with the students. No midterm, just weekly quizzes which were easy. Lecture seem really long, but definitely attend if you want to pass. He usually posts lecture notes online, but sometimes he doesn't so definitely go to class.",
    "Kay is a great teacher! His lectures are very understandable. The book is optional, but a little helpful if you are confused. He is very open. We had an AMAZING TA who made life so easy. My whole class worked hard and a lot of us got A's! YAY!",
    "Dr. Kay is passionate about programming and teaching and you can tell. Sometimes the lectures are slightly boring, but it is programming. He is more than willing to help you if you're having trouble.",
    "He is a very fair teacher. Keep up with the homework and you'll get an auto-A. Don't expect too much help from the TA, just ask the prof. Homework is high at the beginning and middle of the quarter, then not so much later. In lectures, he has a booming and varied speaking voice. Interesting.",
    "Great professor. Very enthusiastic about the subject, and cares a lot about the students. Even though attendance is not mandatory, it is mandatory if you wish to pass the course. Labs are time consuming and the homework is sometimes difficult, but altogether a great course!",
    "He's really nice and cares a lot about his students. Go visit him during office hours!! The attendance is not mandatory but he still wants you to come so you can learn. There's weekly quizzes and homework but no midterm. HW and labs takes quite a bit of time so don't procrastinate.",
    "had him for 41 and 42, great teacher",
    "This professor is willing to go out of his way to help students. Professor has a personal interest in the success of informatics and as such will help in any way he can. Professor is a genuinely decent guy who knows his material and does his best to provide an overarching understanding of the informatics major.",
    "Great teacher, very helpful, easy to contact and willing to help out side of class!!",
    "Very good teacher, Easy grader",
    "Since ICS21 is the first course of programming. You should take him. He is very nice! He care about his student. I learned alot from this class. If you try to do all homeworks , you are in excellent shape. Midterm and final will be base on homeworks (just a little bit harder)",
    "Very helpful, nice, knows what he's talking about. lectures can get boring at times though!",
    "&quot;Weeeeeeeeeehhhl-- that's not the answer I was looking for buuuuuut&quot; &quot;Let's get this show oon theeee roooooooad&quot;",
    "he's a great teacher. knows exactly what he wants to teach and hardly goes on tangents... which can be good or bad depending on what you prefer. but all around good guy. :]",
    "Very good professor. The extras like the Basque Hat, Interpretive Scheme Dance, and his voice definitely distinguish this professor from others. Highly reccomend to any and all, although I still hate scheme.",
    "One of the best teacher I've every had. As caring as a high school teacher, and as knowledgeable as anyone I've ever met. Great teacher, who grades relatively easy, and teaches clearly and very well.",
    "He really really knows his stuff. Very very smart man.. ICS21H is awesome.. scheme is awesome.. excellent teaching language... and you get to avoid jacobson.. heard he doesnt' teach that well.. take kay ^_^",
    "Very cool teacher. Everyone do the scheme dance!",
    "Great professor, very helpful with his students, teaches the material clearly and thoroughly during lecture.",
    "Interesting class. Discussions can get quite repetitive though. Quite an easy A.",
    "Awesome teacher. Too bad he's going to the Informatix department. If you have a chance, take a class with him! (Plus he's a lawyer; passed the bar.)",
    "Great teacher and great person in general. He let me off the hook for a slip up I made. Class discussion can sometimes get repetitive but the topics are mostly interesting.",
    "Very nice, always willing to help, almost everyone gets As! I got a B+ though, cuz I slacked like crazy. Good teacher, knows his stuff.",
    "he's a nice guy. it was a pretty typical class it seemed--not too hard nor too easy. he explained everything pretty well.",
    "Interesting reading materials for 131, sorta lame participation points, overall good lecturer and pretty fun",
    "Very good class, lectures are interesting, gives everyones As Take his class.",
    "No Comments",
    "He hands out A's like candy.",
    "great first ICS teacher, very easy on grading, almost EVERYONE gets A's...definitely take it from him, he really knows what he's talking about",
    "Varies voice. However, lectures still boring, just hope for a good TA. to teach you the stuff.",
    "Really interesting lectures, my first ICS course.",
    "TEACH THE STUFF WE NEED FOR TESTS!!! NOT THE HISTORY."
]