[
    "I have an A-, but it was thru my own work. Online resources > class. You'll be lectured by delusional TA's that have no significant internships claiming that hwk is hard b/c it helps you learn to think for your job. I suggest taking it with an easier professor to focus on the important concepts. After 3 weeks I stopped going to lectures. Useless.",
    "Currently taking him. So far its a mix. He's not bad; but I haven't seen anyone better. Without a doubt, you will learn. Friends aren't doing so well, I only hear the bad end of it. I'm actively listening and learning w/out the stigma of the grade. You'll feel like you're for Trump *cough* Klefstad, or not. This was a consuming class most definite.",
    "Only, and I mean ONLY, take this class if you are a strong independent learner (assume you don't have a professor). His assignments are long and extraordinary. He won't teach you anything but vocabulary. As for learning implementation, you are on your own to figure it out. The first 3 assignments are a cake; but the rest you have been warned.",
    "Study his slides & homework , you still will not do well after 3rd quiz. Used to structure and clear grading criteria? He will grade you based on your talent. The homework will not prepare you. You need to look deeper and nitpick the language of topic (if you can finish the hw on time). Only take if you want a challenge & don't mind a lower gpa.",
    "Klef doesn't teach well. It is hit or miss. He is knowledgeable, and I wish so much that he would actually just talk about the material at hand, and give more direction on the HW. His instructions are unclear, HW can be frustrating, and grading questionable. Even more, this quarter for our class, he doesn't have office hours, because screw students",
    "There was so much work per week, quiz every lecture and homework every week. Having him at 8 am was the worst thing of my life \"JUST SAY YES\"! How about no.",
    "Klefstad's ICS 53 is a lot of work, but you will learn so much about systems programming. He is truly knowledgeable in this topic, but as per usual with Klefstad courses you will have to sit through many rants and raves during lecture. The course grading scheme is fair, but be prepared for mandatory labs and discussions (weekly quiz).",
    "Klefstad will make you work really hard and stretch you but he cares greatly about his student, is an amazing lecturer, very good at explaining concepts, and it's easy to pay attention in his class.",
    "The class and assignments weren't well organized. His instructions and submission instructions were often frustratingly unclear. Additionally during lecture he would often get sidetracked by irrelevant life stories, when students just want to learn. On the plus side, I felt like some of the projects did enhance my C++ foundation.",
    "Very engaging and funny, but the lectures don't teach much and homework is kind of vague. Easy content, though",
    "Not a fan of him, but he is a nice guy. Pros: grading lenient, hw helps you understand material, not too much work. Cons: lectures notes and hw vague, don't learn much in lecture, sometimes lectures on the day the hw is due so self-study beforehand, didn't really teach pointers well. Self-study and you should be able to get A.",
    "He is very humorous, enthusiastic and professional in C++. However, he sometimes deviate from the course notes and starts talking about unrelated things during lecture. 9 hw and 7 quizzes and each quiz is based on the previous hw. Anyway, it's a safe choice to take his 45C. As long as you work hard, you will be good.",
    "He is probably my favorite lecturer at UCI so far; his lectures are funny and engaging. But I don't feel as though I learned a ton in his lectures. The lectures were also a few days behind the homework assignments, so I basically had to teach myself most of the class. Towards the end, I started learning more when he did (optional) live quizzes.",
    "Alot of assignments, so good practice to become a better programmer. You learn by doing. Lecture time not useful. prof very opinionated, not afraid to humiliate students. its his room, his time. he said i love you students but I came to not believe this. fine, its hard to stand in front of a crowd everyday. somewhat scary behind smile. judgement",
    "He is hilarious, fun and a great lecturer. Before I took his class, I was told not to take it with Klefstad and I almost took Thornton's class. I didn't want to wait so I just took Klefstad, and you know what? I LOVED IT. Although he DOES talk a lot about his family and hobbies, his lectures are solid. You might spend some time on the reports tho",
    "Klefstad's lectures are always interesting and fun. The class is also fairly easy, as most of the grade comes from your quizzes and the homeworks.",
    "Klefstad tends to not teach us how to do the homework until the last minute. We're currently writing our own C++ iterators and it seems that a lot of people are confused. He is quite inactive on Piazza as well, only adding to the confusion. Take Thornton for 45C if you can; you will learn C++ better, and learn more problem-solving skills.",
    "Kleftstad is a really good lecturer, and his homeworks and labs teach you a lot. He goes at a good pace. However, he spends way too much time talking about his hobbies and his family. It would be better if he spent that time actually explaining the concepts better. You end up having to learn most of the material yourself, online.",
    "Klefstad likes to exaggerate the difficulty of his courses to keep you on your toes. He's not the most focused lecturer, but he tries to keep you engaged. The real draw to his classes is how they're organized -- no midterm, no final, late credit, all HW, quizzes, and labs. You have to be good at programming, not at test taking, to get an A.",
    "Not sure why Klefstad doesn't have a higher rating. Yes, his lectures often get sidetracked. But he's forgiving with late credit, his homeworks are good and reinforce the material, he doesn't make you take midterms or finals, and his quizzes are fair and easy to study for. He's the dream professor if you don't need to be taught how to learn.",
    "A very good guy to talk to about broad things, but not a very good lecturer. He is very energetic and enthusiastic, but that often results in him talking about actual c++ for only a quarter of the class. Most of the time he talks about unrelated things. This usually results in him giving homework answers the day before they're due to catch up.",
    "Not sure why so many people hate Klefstad. I took him for 45C and learned alot. His notes aren't great, but he gives you enough info to figure out how to do everything. His homework was HARD sometimes, but they are pretty much 100% if you complete them (unlike Thornton). He teaches of C++, so when I took Thornton's 46 it was relatively easy.",
    "He is a good person but he has some serious problems in teaching this course. He spent too much time telling jokes, about his wife and trivial things. His notewas not very clear, sometimes not accurate, had to test his codes before using them. His grading was extremely tough, both quiz and homework. Do not take it if you like a solid course.",
    "Took 3 classes with him already (31, 45C, 46) Instructions on assignments may be unclear, but I think that's only because he just started teaching 46 (at least after a long time). I find his teaching very enjoyable. Grading is pretty fair. Quizzes every lecture/week with lowest dropped allows a lot of opportunity to get a good grade. You'll learn.",
    "Lecture quizzes are open notes so take good notes in class, esp on what he says. Homework quizzes are very similar to the lab. The class was poorly managed at times, but he was dealing with students ranging in C++ skill and was trying to make the class fair for everyone. Hes caring enough to set up a review session for those needed more help",
    "Easily one of the most poorly managed classes I've taken",
    "Take him if u wanna feel lost in requirement. You will spent more time on reports than actually doing the hw. I found algorithms and graphs are cool stuff from my cc's data structure class, but UCI wont transfer it, thanks btw. and how he taught it made this class boring and unclear even though I pay more tuition ;)",
    "Just Say Yes.",
    "Professor Klefstad will make you work for your grade, but you will come out a stronger programmer for it. Take the quizzes seriously: he will deduct 5 points for every error in your hand-written code. I recommend looking over the associated homework before each quiz. Klefstad is hilarious and engaging in lecture. Just say yes.",
    "This class was pretty easy overall if you put in the effort and learned by yourself as the lectures and his notes are simply not enough to get an A in this class. His hw was kind of unorganized at times but they were easy but also boring. His quizzes were based off the hw but graded harshly (each syntax error 5% off). Easier than ics 33 tbh.",
    "Consistently sends out homework with typos and vague directions. Barely made it through 3 or 4 of the slides each lecture as he was too busy heckling students coming in late or talking about his life.",
    "Klefstad is funny, likable, and extremely knowledgeable about C++. He just is not good at conveying the information to the student. He goes quickly in lectures and basically just reads off of notes(which are large, difficult to read). Quizzes and HW are not bad, but sometimes in HW you feel lost cuz things were not gone over in lecture.",
    "He's a very enthusiastic, engaging professor in his lectures, and entertaining. Slides aren't the best/most clear, so overall teaching is just OK. Homework started out fine but as the course went on became very vague due to poor instructions and clarity. Quizzes are fair as he typically tells the topics beforehand.",
    "Professor Klefstad is a very interesting person and clearly knowledgeable. He also has a good sense of humor to help keep students more engaged in class. However, he is a poor lecturer who always goes off on tangents and when he does teach, he teaches material that's barely applicable on the homework.",
    "Quizzes are a major part of your grade, and they are usually a more challenging version of one of the questions on the homework. There is homework due every week and it's usually 7+ hours of work (unless you're a super programmer in Java, C++, Lisp, and Prolog) instructions are vague (he want's you to read his mind).Start the homework early!",
    "Professor is really nice!!",
    "very good course",
    "Professor Klefstad is awesome!! Really enjoy his classes. He can make boring stuff very interesting and you can learn a lot unconsciously. Homework needs some effort, but he always gives you enough time to finish. So don't worry, because you can finish it before due. Really recommend this course. Best professor ever!!",
    "This isn't the hardest class I've taken, but Klefstad has got to be the *worst* lecturer. He goes off on frequent tangents and refuses to teach material required on the homeworks until the day before they're due. If you're willing to study outside and not rely on him to actually teach you though, you should be mildly well-off grade-wise.",
    "Storyteller. Say Yes.",
    "I wanna to focus on discipline. Throughout the quarter, I sent him 2 emails (2nd week and 6th week, diff topics), neither of them received a response. I went to his office 1 week after I sent him the first email, he made up an (awful)excuse that his gmail didn't work properly. When my 2nd email got ignored, I know he is not the right prof.",
    "Professor could benefit the class by organizing lecture notes and giving guides to learn from for the homework assignments. Kleftstad does not understand the value of learning efficiency. Encouraging students to google answers to solve problems is a really bad habit to pass off to students, one that already has cost the software industry.",
    "Professor Klefstad makes you work very hard, but it's for good reason. You'll figure out how good of a programmer you are in his class, but in any case you'll leave a better one. Also this is one class where you won't want to miss class, not just because of the regular lecture, but because he tells the best stories.",
    "You pretty much teach yourself the whole class. He passes this off as preparing you for the real world, and it does, but the same can be said for any class where the prof doesn't teach and you have to google everything. Worst part is though he doesn't give the solution, so if you didn't get the answer you'll leave just as confused as you came.",
    "He is passionate but it seems most of him. I'm going to learn things but not going to fight with sleepy, however, he can do much well in second task than first one. Although he says Stackoverflow is waste of time but at least there arent much off-topic words as exists in his lecture. Tons of hw and quizs w/n timely feedbacks, so do piazza.",
    "JUST SAY YES",
    "I received more feedback from the T.A.s than from him. I didn't receive graded homework until the end of the quarter, and even then some didn't get graded until grades were due. I didn't understand his lectures and office hours were even worse. I get that he can't give explicit answers sometimes, but I would have appreciate more help from him.",
    "Just say yes!!! (His signature phrase). Enthusiastic teacher, not the best out there, but fair enough. Explains things moderately well, shows signs of improvement as a teacher. Class is difficult, and he's only about a third of the reason why - learning C++ in a single quarter might be a little overwhelming for many.",
    "The class lacked a clear structure because he was constantly changing the format and requirements, which was confusing at times. Other than that, the labs and homework are doable and help prepare you for the quizzes and final. He's really flexible and extends deadlines and is good at implementing student feedback.",
    "It was his first time teaching ICS 31 so the structure of the class changed about 2 or 3 times. The assignments difficult also fluctuated about 2 or 3 times as well. As someone who was completely knew to programming, you have to sink a lot of time in order to do well. He makes the class difficult so you would actually learn the material",
    "I was really salty like week0-2 since he basically taught us nothing & threw us into the abyss of compsci but after much self-learning, I appreciated him much more since I learned so much, plus as a person he's nice & lenient, he wanted his students to do well, & tells you what to study for weekly quizzes & put up with a LOT of students complaining",
    "I had no experience in coding going into the class, so I thought the class was hard right from the very beginning. I learned a lot from this class and think it is doable. I just think for a beginner's course it was a lot to take in right from the very beginning. Labs and hw are worth so much in the grade book, so just do those and you're set.",
    "Class was extremely hard at first as someone with no exp with coding, but Klefstad gives a TON of breaks to his students. He extended deadlines, dropped 2 lowest quizzes, labs/hw were graded very leniently, no midterm, and final was only worth 15% and is a guaranteed A+ if you understand the previous labs/hw. Great course overall, learned a ton.",
    "His class have no midterm no final. HW,labs count50%of your grade, basically you will get full credit if you submit it. Weekly quizzes35%and one final quiz in week10 count15%. Thats it, not an easy A but doable A. I spent 95% of my study time this quater got A-, I am not CS major.",
    "Always being passionate in his lecture. Even though somebody think he is talking about his own experience much I the lecture, still teaches all the things contained. You don't need to pay much attention to his class, and easily get A. His class has no midterms but only has several quizes which has been explained in the lecture.",
    "I think maybe Klefstad is a good teacher for professional and some students who are perfect in programming. But actually, Klefstad is really not a good teacher for beginner. He taught many basic things on lec. His HW and LAB are literally DISASTER. You should devote all of your time for his class. But he will extend the ddl of HW/LAB for students.",
    "Not very good at teaching. His sample code does not run. He teaches basics in class, but homework and labs are a lot more advanced. You will have to learn a good amount of stuff on your own.",
    "This guy is a decent teacher but his decisions in regards to homework and labs makes him complete garbage. With Klefstad, expect your lab and hw to take up basically all of your time even if you have outside help. If you don't have outside help then good luck finishing anything.",
    "The workload was a bit heavy for an intro class, but he makes a good point that this class should be hard so we don't get screwed in ICS 32. My main complaint: his instructions are VERY VAGUE. That's literally all that's keeping me from rating this guy a 4 or even 5/5. Other than that, he's a pretty great teacher. You'll learn a lot for sure.",
    "Pros: Willing to extend deadlines, dropping lowest 2 scores for quiz, no final on finals week (final quiz worth 15%). Cons: Way too difficult for an intro class (We're almost catching up to the lessons in ICS32), Lab and HW instructions are really vague and contradicts itself sometimes. TLDR: Brutal workload, but you will learn a lot and fast.",
    "really cool person ....... really bad teacher. This was one of those classes where you have to devote all your time to, even if you are taking more important/challenging courses at the same time. He is a really funny and cool guy, but the class was too frustrating and stressful, especially for an intro class.",
    "Klefstad is what everyone says: vague and frustrating. He is, however, doing that with the best intentions. That sounds odd, but it is true. He leaves room for the student to actually use their brain in order to get something done. If you're not passionate about coding, you must really hate this class. Klefstad makes it fun and challenging. 10/10!!",
    "His lecture is basically reading the notes, and his progress is a chaos. He gives \"hints\" and break down the home work lab projects during the lecture. I got the most knowledge from the lab projects and reading online tutorials. From his lecture I get only 10% of what I should know and others would be some \"hint\" or jokes about Trump.",
    "Some quiz,lab,HW problems he never covers in lecture. And his program cannot run when he does examples in front of us during lectures. Finally he just gives up and that means he does not know how to do those questions.",
    "if you are a cs major student, dont take him!!!!!",
    "Never boring. Very good speaker. Covers almost everything you need to know, but may throw a curve ball during lab that he forgot to explain. Don't attend lectures anymore because it is an 8am, but he posts all the class materials so class is going well. Grading is homework and lab, so class is an Easy A provided you actually do them. Final only 10%",
    "While he was a great professor and he was never boring, at times I felt as though his jokes were inappropriate . I was not offended but I did feel uncomfortable.",
    "Klefstad is passionate about computer science but does a bad job at teaching it. In his lectures, he talks more about his personal life/achievements more than teaching python. It's kind of discouraging for those who don't have experience yet. In lab, we're asked to use commands not even covered in lecture! Don't take Klefstad!",
    "Not good. He was talking all the time about how he hated trump and about his wife and him fishing instead of making lecture. Really. He spent at least 10 minutes of each lectures (not contigously) making jokes an interrupt student's attention heavily. Not a serious professor. Does not take education seriously, I don't care about your son stories.",
    "Would give a 0 if I could pros: funny person, interesting lectures (meaning: good jokes), chill dude cons: useless notes: short, unorganized & hardly no explanations lecture: a lot of off topic bs confusing assignments: basically no explanations, vague grading criteria useless office hours Back to Pattis this quarter, way better in all aspects",
    "He is Hilarious definitely. U will enjoy his lectures but later find out that u need to re-study all the stuff for hws and quizzes. Weekly quizzes and challenging hws push u to study. His final is all multiple choices and it is hard!(he repeats this every time in lecture) Don't miss a lecture since he tells u what's gonna be on quizzes and final.",
    "Although a little bit unconventional at times, I will always take a class with Klefstad over other professors. He really cares about the material and I really like the way he structures the quizzes and assignments.",
    "Terrible at helping students put lectures into practice. Constantly brags about his life and how \"Great\" it is. Notes are very unorganized incomprehensible when looking back for hints. The homework is really heavy, especially if you have never learned c++ beforehand. Will make you feel inadequate by telling you that he is better than you.",
    "Lost tons of sleep with 53, but I learned more than any other CS class at UCI and built foundation for future upper-divs. Klefstad is a hard ass, but he CARES about students and INSPIRES them to give it their all (gets to knowing their names too). Yes, there's gonna be tons of work, but you'll learn so much more than before if you actually try.",
    "I would give Ray a B or B+. He gives nice extra credit if you submit homework earlier and some extra credit for good answer on piazza. These extra credit helped me got an A. However, the notes aren't clear enough, you need to search many of them by yourself in order to know the C++. Lecture time isn't boring also not fun.",
    "Enthusiastic and energetic teacher. Helps solve homework labs in lecture. Provides helpful online lecture notes. My favorite ICS teacher at UCI.",
    "Lectures notes are confusing and unorangized. Says things once and doesn't explain it. He assigns ambiguous assignments and is a harsh grader when you don't meet the expectations. The final was not based on most of the material and the notes did not help. The only things that matter is what he says but he doesn't go in depth.",
    "Klefstad is unique. He hates Python, and he loves C. He wants everyone to master C. It's painful, because C is a low level language. He spends a lot of time in class to talks about his life and tries to be cool and fun. Some students enjoy this, but some think it's totally a waste of time. It's up to you to like or hate him, but he is a good guy.",
    "I am taking this course now and this professor doesn't quite understand why he is wrong. It seems like he's presuming every student in his class knows C++ like an expert. (True, there are tons of transferred students. But not all of us are!!!) He speaks so fast, and shouts out loud \"JUST SAY YES!!\" to us every single yes-no question he asks.",
    "This was a very fun class! Dr. Klefstad is hilarious, inspirational and gives great lectures. The lectures don't help much with the assignments, but you will never leave class disappointed. I relied heavily on the book and utilized his office hours as much as possible. He is very helpful and will spend a long time explaining concepts. Great class!",
    "Dr. Klefstad is by far the most inspirational professor I have ever had. I always left his lecture motivated and determined to learn as much as I can. That being said, the class isn't exactly straight forward. His slides are confusing; expect to teach yourself a lot. He's truly brilliant though! Amazing professor, tough class, absolutely worth it!",
    "This class is not hard, it really isn't. He just doesn't know the material well.",
    "Very passionate lecturer and is always willing to provide help as long as you are willing to learn. Class has a lot of work but simply because he cares for his students and wants them to learn.",
    "This was the most time consuming class I've ever taken. Having said that, I also improved in general programming ability more than I ever have in one quarter. Because of that, I'm glad I took this course with Klefstad. He's hilarious and very passionate about teaching.",
    "His lectures are not that helpful and this class is mostly lip service to its catalog description. He essentially wants to teach C and makes the class fit that goal. To be fair, he does genuinely seem to care about students, but he seems unable to articulate it well. The grader just ran automated test cases, this was abused.",
    "Talk about a complete disregard for students' time. Klefstad isn't kidding when he says he expects you to spend up to 20 hours on homework every week, and that doesn't include his timed labs and quizzes. Not a difficult class per se and he is very helpful during office hours, but you can bet that I won't ever take a class with him ever again.",
    "Whatever you do, do not take Klefstad. The worst teacher I've taken. Quizzes are peer graded, but you have to go into office hours to get it fixed (which you will, \"If it seems right then mark it wrong\"). Problem is, it would take 2 hours to see him for office hours, so I could never do it because of my class schedule. hw was unreasonable, avoid!!",
    "His first time teaching 53. It was a mess to say the least. He expected way too much time out of us to do his assignments and his instructions for them were usually vague and unclear. Also the quizzes were peer graded, which caused many grading issues He does have good intentions and is a great lecturer but the way he structured this class was bad.",
    "Difficult. HWlabs are always vague. Unless you're a wizard, you will be swamped with work every week consisting of: 1 long hw assignment, 1 lab problem you must complete in 2 hours (as well as another due later), and WRITTEN quizzes. And he doesn't post solutions for anything ever. Office hours are the only help. Good intentions, bad teacher.",
    "Klefstad is a good lecturer but the lectures will NOT prepare you for the homeworkslabs he assigns. Quizzes are peer graded. Also, his quiz directions are extremely vague and if you get a correct but different solution, he tells the students, \"Mark it wrong and they can come to office hours if they want me to fix it.\" 53 was 1000x harder than 51",
    "WORST PROFESSOR EVER. Took him for ICS 53. He had so much work, couldn't cope up with the class. Hard grader. Assignments are equivalent to 10 classes taken together. If you take 53 with him, you will end up failing all the other classes cause you won't have any time for to work on them. Doesn't understand students have other classes and a life.",
    "So this class is essentially broken up into two parts - the lectures and the labs. I say two parts because they feel distinct, unlike other ICS classes. I gotta say, Klefstad is great, but sometimes the material isn't explained in the best way. And the labs aren't too bad overall, but they can be frustrating. The Rolodex lab is just TOO LONG.",
    "Great lecturer, extremely disjointed class. I learned more in this class than I have in most of my courses, but be prepared to work for your grade.",
    "Klefstad admitted this was his first time teaching the ICS 51 material, and it showed. Lectures didn't correlate with quizzes and he couldn't even help us with certain things. Thankfully though, he recognized this and slowed down, admitting that it was too hard. So all was good at the end. He is otherwise a great professor and knowledgeable.",
    "His lectures are pretty useful for the homework and quizzes. The homework varies in difficulty, so you should get started on it as soon as possible(especially for pure Python programmers) to avoid headaches or turning in the assignment late. Quizzes are based on HW Gave option for multiple choice final(HARD) or regular quiz style final",
    "When the average for the second quiz is a 35%, you know something is wrong. This class is broken. Dr. Klefstad openly admits that hardware is not his area of expertise, and it shows. His lack of communication with the TA's make studying for exams impossible. It is a shame, since he seems like a very nice guy, just not a very good professor.",
    "Great person, great sense of humor, and seems he has an awesome life. Lectures were interesting at times but not helpful; It's like he would teach us 1+12 and send us home to derive the mass of an electron using strong induction and relativity laws. However, if you've taken way more classes than ICS 33, it's an easy A with some self-teaching.",
    "The worst class i have ever taken.",
    "Said at the beginning that textbooks were not required. Later said that they were, after they were no longer easily available. HW and quizzes had nothing to do with lecture. The TA's apparently wrote all the assignments, and he had nothing to do with them. He also lied occasionally about his interactions with the TAs. Average on tests was about 30%",
    "Be prepared to study. You will have to go all over the place to find information, because for HWLabs, they will not provide the information needed to complete the assignments. They are helpful when you ask for clarificationinformation, but will not provide all the tools needed to complete assignments effectively.",
    "agreed. fast-paced, lots of material to cover, but definitely worth it! you work your butt off but the class gives you a rock-solid foundation for the programming classes to come. it's been awhile since i've taken this class, but it's the only one i truly enjoyed and am grateful to have had him as a prof.",
    "My first ICS class 8 years ago was ICS21 with Dr. Klefstad. He may not know it, but it was his class that made me who I am today, a very successful Enterprise Architect for a huge consulting company. Yes, the class was tough and alot of people failed...but the lessons learned from failure became the key to my success. His class was invaluable.",
    "Best professor I've ever had.",
    "I owe pretty much everything that I know about coding from this guy. He's the best professor I have ever had even though I failed his ICS21 class the first time, but I came back with an A. haha",
    "Very tough class. He's somewhat of a condescending jerk at times...but he somehow manages to teach you the material better than anyone. If you want to LEARN about programming, he's the guy to take.",
    "His lectures include interesting stories which help maintain your attention to the lecture. He knows his material VERY well. He teaches it VERY well. And, he tells you exactly what will be on the exams. He helps you alot with HW's as well.",
    "Arguably the best professor I've ever had. Knows the material extremely well. If you want to be ready when you graduate, this prof is the one that will prepare you.",
    "He is good at making ppl laugh. He makes jokes all the time in lecture and they are enjoyable, but it eats up lecture time. His attention diverts easily in lec & converstaion. I Had three of my classes with him in ICS, he has much demands for hw & tests.",
    "198 turned into 144. he was easy on us for some reason, but he's a great professor. keeps you interested, motivated, and teaches well. we stole him from ics, lol",
    "dr klefstad was an extremely tough professor. i must have spent more nights in the computer lab than out partying with my friends because of him. but overall, i know what i know now because of him.",
    "Awsome Teacher...",
    "This guy taught me the programming skills i have..and I am a good programmer. All he does in lecture is tell stories....very difficult, but funny. Take him if you are serious about your career.",
    "Great professor. Tough grader but well worth taking",
    "Lots of stories, hear the one about nitrogen narcosis&#63; Great teacher, knows his stuff. If you work hard listen to him. You'll do fine. Teacher of the year(7)!",
    "Hard to gauge...has reputation of being really hard, but he was somewhat easy of ECE144...tests and programs are relatively easy...GREAT lecturer.",
    "ohmigosh... i learned to program from this guy. hard but shoot. U WILL LEARN! powerpoint notes online very cool.",
    "fun prof... but wish the class were a little more involved...",
    "No Comments",
    "His test are kinda of hard but it is a fun class",
    "Awesome teacher! Class is lots of fun"
]