[
    "If you like a CS prof to type 1 word per min, then this is the guy for you. I had no idea what was going on in lecture because he's so dry. If you like reading 30 page novels for notes, then this is the guy for you. But his in-lab exams weren't that bad tbh",
    "Notes are LONG but VERY informative and Pattis explains concepts really well. Class is organized, instructions extremely clear, and grading fair. Lots of homework BUT worth it. The key to doing well is to read all the notes, and start EARLY on assignments. HIGHLY recommend because you will learn a lot! Best professor I've had so far.",
    "All professors should be like Pattis, very well organized , gives you all the knowledge you need in his very long and specific notes, his website has all the due dates and he is always in constant communication with the students so youll never not know whats going on. A TON of work but It is worth it in the end , you walk out knowing a lot more.",
    "Pattis is a great professor. Despite all the work he gave throughout the quarter (5 Programming Assignments, 8 Take-Home Quizzes, 2 Lab-Exams, Midterm, Final), he actually makes you learn. All the work is aimed to help you understand Python a lot better which will be very useful.",
    "Overall a great CS Professor. Workload is heavy, quizzes nearly every week, programming assignments every 2 weeks, 2 in lab exams usually around week 4 and 8 and a midterm and final. Although workloads heavy, it makes you master the material and become a better python programmer. Midterm and final are fair. If you put in the work, youll get an A.",
    "Long notes. Heavy load. Unreasonable policies. Avoid him if you can.",
    "The course is not bad, but the workload is relative heavy. About 2 coding assignments need to do pre week, and 4 Test (2 in-lab, midterm, final). If you do not have good skill in coding before taking this class, your enthusiasm for cs will reduce after this class. The midterm and final is not hard, but you will lose point easily.",
    "A lot of work but help you learn a lot...",
    "If you are planning to take the class, DON'T. All your free time will be spent coding :). Your life will revolve around this class Funny guy, loves Pinterest. You is welcome",
    "Awesome sauce!",
    "Pattis's classes could be good, but he's no Klefstad. He's uncompromising, demanding, and unforgiving. His class isn't HARD -- merely stressful and unpredictable. If you're well-organized and good at meeting stringent deadlines, you'll probably pass easily. I fell into major depression the quarter I took his class, so long story short, I wasn't.",
    "Pattis is an inspirational professor. His lectures are worth going to, you can't miss those days when he cracks a legendary CS joke. He genuinely understands the students and his grading scheme is quite generous.",
    "Organized, knows what's he doing, knowledgable. Boring though.",
    "What a god. Best prof at uci.",
    "I loved ICS 33 with Pattis. He is very clear with how he grades your work; he gives you all the tests to run for your code. His notes are ugly, but super informative. I genuinely feel like I learned so much about Python after taking this course. You need to put in the work (weekly quizzes, a project every two weeks, etc), but it pays off.",
    "Lots of hw,yes. But everything else is fair. He gives you all the tests that he uses to grade your hw and quiz. If you really work hard, how can you get a terrible score on these parts? And one below who said lab exam is hard---did you even do the sample exam? Mid and final are not easy but he curves a lot and only about 35% of your total grade.",
    "Lots of tests: 8 take-home quizzes, 2 in-lab exams, one midterm and one final. Attending lecture is not always required (sometimes you have to hand in some stuff in the lecture); Pattis just reads out his super long notes in the lecture (although the notes are useful). If you did well in ICS 32, ICS 33 will not be hard.",
    "Professor Pattis is the pinnacle of ICS at UCI. This man has an incredible class structure and is very organized. People consistently talk about his workload, but it is easily manageable if you start early and don't procrastinate. Help is easily accessible if you need it. Midterms and Finals are more than doable if you actually read his notes.",
    "Pattis' class is really organized. Lecture is not much more than reading the notes, unfortunately. Fair grading and testing criteria.",
    "Heavy but consistent workload, which allows you to get into the \"flow\" of work. Planning ahead is a must, and everything else will be manageable!",
    "Heavy workload but you'll learn a lot. Very organized and clear on expectations - can guarantee 100% on programming assignments by checking against the provided batch self check tests. Written exams are dense, but in the end due to the written exams not weighing heavily around 40% of the class ends up with As.",
    "The class is a ton of work, largely due to the reading material. However, the reading material really feels purposeful and valuable, explaining key Python concepts better than almost any other reading material I've read. If you always start reading and working on assignments WELL in advance, you'll do fine. He's very knowledgeable and it shows.",
    "Heavy workload in this class but it's really unavoidable with any 46 professor. Very tough tests, programming assignments are implementations of c++ STL and he provides you with google tests that help a lot. I gained a lot from this class but it also seems like a bit heavier of a workload than Thornton. Take-home quiz every week. Lecture optional",
    "Best ICS professor I have met so far. His basic self check program is really helpful for project. It's easy to keep track of your grade in his class. I did not feel any difficulties writing code in this course. However, written midterm and final exam need to be treated with cautious.",
    "Only some of his lectures are somewhat helpful, but not many. However, he provides more than enough resources to do well in the course. His website is like an encyclopedia, but you get used to it. Overall, the amount of detail and work is overwhelming, but if you can get past it, you will become a great python programmer.",
    "It's a lot of work, but you learn a lot. The grades are heavily skewed towards if you put in enough time into your assignments, around 50% of the grade is based on programming assignments &amp; take home quizzes. So it's pretty easy to get a good grade in the class, if you put in the time. Not good at lecturing though, just reads off notes",
    "Very touch exams. You will be asked to write several functions on paper and pencil on midterm and final exam.",
    "Very tough class! Quizzes are mind wrecking, programming assignments are long, in lab exams are not very easy either and written exams are quite hard. Lecture is not very helpful because he only reads through his super long notes but his notes are important for written exams. I am glad I passed his class in one go. It was very stressful.",
    "He made everything so difficult for students. Lots of homework, quizzes, in lab exams, midterm, final...... It doesn't feel like this is a 4 unit class. Maybe 8 units looks like more reasonable. lecture doesn't help on anything. Notes are super long and not straightforward.",
    "His class is A LOT of work. There's a quiz nearly every week and the program assignments are lengthy, just like his lecture notes. I do like how he provides code so you can check whether or not your programs are doing what it's supposed to do. The in-lab exams are easier than the written tests for this reason. He's definitely knowledgeable.",
    "Pattis' class is difficult, but his teaching is very good. His notes are super long, but they have all the info you need, so read the notes!! Individual assignments and tests are curved. He provides pictures and in-class stuff for some concepts, which is nice. Office hours get super packed tho. A lot more work than other classes, but still doable.",
    "I dont like him. He gives the way too many works and it makes students hard to breathe. Especially for me who is not very good on programming. However, I have to read the notes very fast in order to submit my homework on time. I devote all of my times to this course. I always finish my work by midnight, but I got a very bad grade. I am so sad.",
    "Professor Pattis has really really really long notes and you will receive a passing grade just by reading his notes. His extra credit policy encourages students to work on problems early, and students who submitted early actually have higher grades. His exams are hard, but if you understand course material very well you should be able to get an A.",
    "Professor Pattis is an amazing lecturer. His lectures are clear and if you have questions, he's very helpful during his office hours. His grading criteria is very clear and his notes are amazing. All of his notes are in .txt but still are very well formatted and complete. Read his notes and you won't regret it. His tests are fair.",
    "Very very hard class! Be ready to study extremely hard. The work takes you most of free time!!!",
    "If you're a committed reader and notetaker, you can pass the class without going to lecture since lectures are dull. With that said, Pattis's class covered topics that I have been asked in many of my interviews for jobs. He teaches material thoroughly (though his notes are loooong) and in a way that you retain the knowledge for a long time.",
    "Pattis and his long notes are very informative, and I did learn a lot. The quizzes and projects are not difficult but the class is a constant grind and there is a lot of material to go through, so it will be easy to fall behind. The midterm and final leave no time for thinking so you need to know your stuff",
    "I took Pattis for my first quarter at UCI. I had failed to learn anything useful at my community college and, through no fault of his own, was completely lost at first, but after attending many office Pattis helped me become much more confident and I felt so much better prepared for the coming quarters.",
    "It's really really hard, I will never take this class before",
    "I loved this professor. However, It helps that I love computer science. If you come ready to learn, Pattis will teach you so much and you will become a lot more confident in your coding abilities. Do all the work and projects and the class is easy! Although the notes were a bit intimidating, I enjoyed every lecture. Loved this professor!",
    "I liked him for ICS 33 for the most part, but then taking him for ICS 46 was terrible. Glad he doesn't teach upper div.",
    "Read his notes. Pattis gives you all the information that you need to succeed in the course in his massive course notes. They are dense, but you can use CTRL + F to search specific terms. The programming projects can be difficult but he gives you the tests he will run so you can know exactly what your score will be.",
    "Pattis is more cut out to be a researcher than an instructor. Although he knows what he's talking about and tries to inform his students the best he can, his notes and lectures are convoluted and extremely cumbersome to read. Additionally, he will assign labs and quizzes at the same time (like ICS31), but it will feel like a VERY heavy workload.",
    "ahPattis with his 99c whiteboard. Pattis honestly was born to teach, really puts in the effort of preparing his materials, his lectures were,lets just say, not the most interesting. batch self checks make everything clearcut if not easy. does care for students though cynical at times. work is needed but rewarding, and doesn't take insanely long.",
    "Amazing and respected professor. The class needs daily work and can't be learned just before the midterm. The final was a bit harder than expected and should not be taken lightly.",
    "His lectures are bloated and boring (and he is in desperate need of a whiteboard that doesn't look diseased), but his assignments and quizzes are pretty easy - if you follow along with his overly long notes online, you should be able to get the assignments done and pad your grade with the early turn-in extra credit",
    "Reads off of the 8-font lecture notes in large blocks of text and does his best to explain things that aren't obvious. Guy doesn't smile much. Class is fair and a little tricky, but not impossible.",
    "Had him for 33 ,46. My opinion of him improved from 33 to 46, even though the class structure is the same. If you can keep up, you will learn so a lot, but the workload is intense (quizzes take time, but aren't outrageous. Programming assignments (for 46) are pretty hard.) I REALLY wouldn't recommend taking a heavy course load with him.",
    "Attendence is optional, but you better show up. His lectures weed out the massive manual that he calls \"lecture notes\" down to what you need to pass the class. Yes, he is a jerk sometimes, but I highly respect him because he is a walking encyclopedia. If you are passionate about coding, it will be very possible in getting a high A. Otherwise... gl",
    "He is a lousy lecturer with an off-putting attitude. His lectures just consist of scrolling through and reading his verbose plain text file notes. Heavy workload, with a weekly take home quiz and biweekly programs. It is pretty easy to get an A in the class if you do the work - the grading system weighs the homework heavily (also batch self check)",
    "His lecture notes are the primary source of content, but are massive walls of text - his writing style is INCREDIBLY verbose, and his lecture notes have no formatting beyond ASCII drawings. So they are a pain to read. There is also a constant stream of work - labs, quizzes, in-lab exams, written exams. You will learn, but it will be painful.",
    "I took this class along with Math 3A and Informatics 43. All my attention and time went into this class. Must read notes to pass. Didn't really like his lectures too much since he just read over the the novels for each week.",
    "be prepared to spend a lot of time in this class. he assigns a programming assignment that is long and then there are also quizzes every week. he doesn't provide much help when you ask. you dont get a lot of time when you do the midterm. he is just a hard professor who doesn't take into consideration how many other classes you're taking.",
    "you have to read a lot and there is no summarized version or note. I like coding but I had hard time reading his stuff and it was extremely boring.",
    "After taking 45c with Klefstad and 51 with alfaro, I felt that Pattis is one of the best professors in CS. At least, we have notes to read and clear assignment instructions :)))",
    "Pattis is a clear professor, and gives students a lot of work. The students should not fear the workload he gives, especially if you are passionate about programming. He gives you the chance to expand your knowledge beyond what was learned in 32 or 31. His challlenges easily made me a better programmer by far. Get ready to read (or skim) his notes.",
    "Beginning of the course there was a ton of reading to do, however as the course went on the amount of work lessened. The same goes for the programming assignments and quizzes that are due every other and every week, respectively.",
    "Reads from his notes during lecture so it really isn't necessary to go. How you really learn is from sorting through the notes yourself to do the quizzes and programs. If you have a mostly clear understanding of how to do them, you'll be fine. It's not hard to get a good grade since bsc tells you exactly how your code should work.",
    "Pattis has a way of explaining his core points in each lecture, and they are full of information you will use in the exam and labs. Honestly, the biggest lessons do not come from the readings (although there is A LOT of dense information), it comes from doing all the exams and programs correctly and understanding what is going on.",
    "The guy is an egotistical jerk. AVOID AT ALL COSTS! Falsely accused of cheating (exonerated from all charges) heard from others that he tends to falsely accuse people so be careful when you code. He also reads from his notes in lecture so theres no point in showing up. The work is alright, just a lot of work.",
    "A lot of reading, even during the class. Yes, he just reads his notes during the class.",
    "Do the quizzes on your own. Sorting through the information on the readings while trying to find the answers to them really helps you in the long run. Having those checks on the programs makes it easy to get an A on the projects. I would've taken more care to read if I could. Be sure to at least skim the readings before written test. GO TO LECTURE",
    "This class itself is not hard. However, with his fantastic teaching skill, I understand xxxx in this class. I participated in some online programing training programI. benefited a lot from it and I gained confidence of programming. However, with Pettis ,I lost all my confidence. He just bullied you academically by using his authority. Great !",
    "Professor Pattis is a good professor if you actually listen in class and read his lecture notes. Although they are quite dense, his notes provide very useful information for quizzes and programming assignments. The workload was very intense with weekly quizzes and programming assignments every two weeks. And asking questions really helps a lot!",
    "Easy class, but boring. Pattis is the type of guy who does a lot of hand holding and writes long ass instructions for each assignment; but because of this, a lot of people don't even read them and might have trouble with the labs/quizzes. His online notes are long and disgusting, Google is way more useful.",
    "Somewhat dull lectures. Insane amounts of notes, so finding important things or knowing EVERYTHING you should isn't really feasible. Most of class is not based on paper tests, and assignments can be gauranteed to 100% (batch self check). So, getting an A is rather easy, since most of grade is free. Quantity quality in examples unfortunately",
    "Be ready to work many hours for this class. It's called ICS 33 because it will take 33 hours of work per week from you to get through it. Do well on the in lab exams and you should be good based on program 1 and 2. Midterm was alright. Final was super hard.",
    "Worst teacher ever. Let's not talk about his quizzes, assignment or exams, because these help students with their growth. However, his notes are very hard to understand due to his grammatical errors and writing style. He also have some ridiculous policies regarding his class. I highly suggest avoiding this teacher.",
    "Hardest class I've taken in my undergraduate class and a lot of students will blame it on Pattis but in reality they just couldn't step up to the plate. Pattis cares so much about his students, and was so reassuring when I visited office hours. Rare to find such genuine professors. He knows his material and the notes kill but you learn so much.",
    "Amazing lecture, you can learn everything by just going to the lecture. Not much assignments, they have really clear instructions and they are not hard at all. Midterms and finals are easy As, as long as you go to his lectures. His notes are straight, short and simple, make sure you read them WORKD BY WORD. Great teacher! Can't wait to take ics 46!",
    "pattis is a homie. gives a lot of work, but you'll learn so much from the class. each lecture he publishes a separate novel worth of notes. which you HAVE to read in order to do the quizzes and the midterm. my god the midterm. was like 9 pages long in 50 minutes. btw his c++ is nooby af he never deletes anything, but pattis is very intelligent",
    "People are cheating their way through the class whether it is by addy or through past solutions. This guy is evil. People are taking drugs to pass this class. Students are not learing, they are just memorizing and taking test. No wonder UCI ICS students don't find jobs after school. Apple and Google are recruiting from cal polys and UCSD and UCB",
    "His detailed notes (skim them) are mostly what you need to do well. If you skip lecture, you can make up for it by reading, but it saves time to just attend. You can find most of what you need for quizzes/programs in the notes. Give yourself at least 3 days to work on them. Use bsc! Grades fairly. Written exams test concepts, in-lab tests debugging",
    "He writes a TON of in-depth notes that may save your ass during the quarter, making the textbook essentially useless -- don't buy it. Our class had weekly \"quizzes\" aka homework, bi-weekly programming assignments, 2 in-lab exams, 1 midterm, and a final. Overall, expect a lot of reading & work in general. Pattis will take up a lot of your free time.",
    "Quizzes are so hard. Exams are even harder. I cannot handle it. But the professor is very nice.",
    "Be aware that Pattis is super anal and may accuse you of cheating regardless of if you cheated or not. Be prepared to spend lots of hours outside of class finishing assignments. Good curve and gives a little bit of extra credit. Provides notes which is helpful. Google is truly your friend in this class.",
    "Pattis is not a good lecturer but his notes are comprehensive and you can learn A LOT by reading them. Doing so will get you a good grade in the class and it won't be necessary to attend his lectures. Also, his class is a lot of work, so choose classes with a lighter workload. His class is fun except the weekly quizzes can be annoying at times.",
    "Program 2,3,4 are too hard(1 and 5 are easy). Tests and quizzes are fair. A lot of work but worth it.",
    "You are expecting taking two classes at once with extremely unclear quizes, programs and exams. This guy literally is reading his lecture note during lecture. You will spend your entire life doing his program assignment and not even 10% of it is gonna be on the exam. It's not a hard class, but he makes it extremely confused with his own error/fault",
    "This class can be frustrating and there is a decent amount of work. If you want an A, you need to follow all of his IDE (Eclipse) setup instructions, read all of his lecture notes (make sure you highlight all the important parts for reference), and start programming assignments as soon as possible (there will be a lot of bugs). Have fun :)",
    "Be ready to deal with buggy code, and spend more time figuring out how to get his library to work than actually programming. If you are not an expert in linking c++ libraries, you have to use Eclipse on Windows or you will double your headaches. If you can, take any other professor for this class. Also class is not curved.",
    "TOOOO MANY WORK! HARD EXAMS! MEAN ATTITUDE.",
    "This class was a challenge. 8 quizzes, 2 in-lab exams, 5 projects, a midterm, and a final. He tells you exactly what he wants by giving a self check program. Projects are fun. The midterm and final are going to be tough. the in-lab exams are basically knowing how to program without google. The quizzes were the worst, they were a nightmare.",
    "Definitely a knowledgeable professor, but many people had difficulty with the class. Make sure you study and go to lecture for the most part or you will be completely out of the loop when it comes time for tests.",
    "I fell in love with programming after taking ICS 31 and having Pattis introduce me to it. He takes you from never having used more than Microsoft word to being somewhat decent in Python. Dont get me wrong this class is by no means easy at all its very time consuming, but it is clear, fair, and you will come out of it KNOWING what you learned well.",
    "Pattis is a very knowledgeable professor. He is very helpful. But his lectures are dull and boring. And his notes are way too big to read. This class is not hard, but it is too much work for 4 units. 8 quizzes, 5 projects, 2 in-lab programming exams, midterm and final. Quizzes will haunt you the most.",
    "Tough class, I'm second language, so it's like hell. Advice: Read, summarize the notes, do ALL assignments. Love: All the materials he taught, really cool and helpful. Hate: Everything else. My feeling: sometimes I like him, sometimes I hate him so much I feel like I'd better drop the class. Thanks god I go till the end.",
    "Definitely a tough class. Pattis is a pretty good teacher, but sometimes rambles in lecture. Make sure to pay attention because plenty of students failed this class.",
    "Lectures aren't very fun, they tend to drag on and most people get distracted. A lot of the compsci taught in the class is more abstract than previous ICS classes. Weekly quizzes, along with a lab program due every 2 weeks. Regardless of the work load and lectures, Pattis is actually REALLY good at teaching and you will learn a lot.",
    "Pattis' ics33 is really tough, but CS is a tough thing itself. His quizzes are helpful but some of the programming assignments are not related to the lecture material at all. He is not a fair grader. He only grades according to the number of incorrects. But you can really learn a lot of things if you pay attention to this course. I love Pattis.",
    "The lectures are really boring for a majority of the time. He never writes any actual code. Just reads through lecture notes an sometimes draws some diagrams. WAY too much homework. If you take ics33 with Pattis, make sure the rest of your classes have a fairly easy workload. You need to dedicate most of your time outside of class to his homework",
    "Ok, I have already read some reviews about Pattis for ICS 33. Even though there are a lot of bad reviews about his class, I still think he is one of the best professor who teaches in his own way. His lecture is decent, but his notes are AMAZING!!! Like seriously, if you read the notes at least 2 times, you will learn a lot and do well in his class.",
    "Can't recommend. He's not bad; you can tell he loves what he's doing but I feel that he's really inefficient at teaching it. He takes pages to teach about a topic that could have been explained in a few paragraphs. His lectures are really boring and maybe 25% attend. Maybe he should've been a writing professor because this guy can write for days.",
    "Never have I been more frustrated- his assignments are scary. Weekly quizzes and labs. He REALLY likes to write. There's a lot to read, and you've got to read very closely or you'll miss out on crucial details. Can I stress HE WRITES A LOT. YOU WILL BE READING. A LOT. THIS IS A STRESSFUL CLASS.",
    "Long notes that aren't very clear. Assignments and quizzes are very wordy and can be misinterpreted easily especially for non-english speaking students. Boring lectures. Class is not impossible to do well in but it will consume a lot of your daily life so be prepared for that. Very useful office hours but lectures can make you fall asleep.",
    "By no means is this an easy class. There's lots of works so if you can manage it whilst doing the reading, you'll be fine. Reading his notes is essential as most of the questions on the final are based off those readings. Assignments took a lot of my time, but it was well worthed at the end. Take only if you have time to spare!",
    "Pattis seems to love teaching and he's really good at it. Assigns a good amount of work, but it never feels unfair.",
    "The more times I take a course with Pattis, the more I begin to appreciate what he has to offer as lecturer. His notes are thorough, his grading criteria is clear, and he is quick to answer any questions you ask him. Yes, he is very traditional in terms of teaching style, and his exams can run a bit long, but he does his job and he does it well.",
    "Good luck, that's all I have to say. Thankfully the notes help immensely with the quizzes and programming assignments, but they are novels in and of themselves and written in plaintext. His lectures consist of him literally reading his notes from the website. Make sure to start the assignments EARLY as there will be many bugs in your code.",
    "His lectures aren't very interesting but he makes up for it with his very thorough notes. If you read his notes, you can do all the assignments for this class. Assignments are reasonably challenging but his tests expect you to do a lot in a short amount of time.",
    "Garbage class. Taught material not even relevant to the course, and built his own data structure library to use for the course, which barely worked and had multiple issues. The course should have been named \"How not to make Data Structures and algorithms\".",
    "Usually dry lectures, but he can be funny if he wants. His whiteboard demonstrations really help visualizing concepts, so I recommend attending lectures for them. Assignments are doable, although 3 out of 5 of them are basically the same thing. Exams are very difficult. You can get by with his notes, but be aware they're long (albeit thorough).",
    "His notes are dry but more easier to follow than his lecturing. He answers emails quickly and is always willing is to help. However, there's weekly quizzes and long assignments so be prepared to put time into the class if you don't pick up things smoothly. Eclipse is awful but you need to use it for testing your programs in this class.",
    "This class should just be called Pattis Structures and Algorithms, bc of the assignments alone. Your basically implementing a linked list version of every array structure that he gives you. Pattis also has really poor C++ skills. Memory leaks everywhere for the sake of shortening code. You might learn some theory, but no applicable C++",
    "Here's the bottom line. This course's name should be changed from \"Data Structures\" to \"How Eclipse Gives You Depression.\" Don't get me wrong. The actual concepts you learn in this course are pretty useful, but the real challenge is trying to use the awful (and I mean AWFUL) Eclipse environment. And if you have a Mac it's about 1000x more painful.",
    "Lectures are very boring. Weekly quizzes that are like mini programming assignments. In addition to large programming assignments due every 2 weeks, usually having to do with implementing a data structure. He uses Eclipse, which is very annoying to work with! I had so many problems using Eclipse on my Mac and some programs wouldn't even compile.",
    "This class was honestly one of the easiest classes I have taken here at UCI. If you had Professor Kay for ICS 31 and thought he was easy, you have not seen ICS 33 with Pattis yet. This is an easy A. I took this to fulfill my GE's and it was a breeze. Would take again.",
    "tough teacher, tons of work to do like we dont have other class",
    "One word: dry. But if you can get past this, then he is very thorough. If you pay attention, you will learn A LOT. As for workload, it's pretty tough. Programming ain't easy, but if you make use of the message board he has and really get in the zone, you will do well.",
    "Very difficult class if you enroll without any prior knowledge to programming. His pace is very quick and gives large amounts of work that will keep you busy either doing his work or studying for the exams.",
    "Honestly not impossible to pass. Just that between his take-home quizzes and labs, he gives an WAY too much work. His workload (as well as work from other classes) makes being able to go through all of his extremely verbose (yet helpful) online notes impossible. He could teach the class in a much simpler way, but is instead wordy and ambiguous.",
    "Professor Pattis is an excellent teacher. His assignments and exams are very fair, and he does a great job answering any questions you have and making sure you have access to all the materials you will need for the course. The only real problem I have with Pattis is that his attitude makes him not very likeable, despite his ability to teach well.",
    "Lectures are dry and gives lots of assignments but gives lots of chances to improve; lots of extra credit and replaced midterm score with final score. He gives you the test script they grade programs with so you know you're right. If you're new to or not serious about programming, you'll probably be mowed down by his timed in-lab programming exams.",
    "Very very boring and pointless class, avoid at all costs if you do not have programming experiance. You will not do well.",
    "I came into this class to spend time on programming not to spend time trying to understand his labs. I have lost all interest in programming this quarter because his lab assignments are not clear at all! All the time spent understanding his assignments on top of all the work he gives leads me to believe that he doesn't think we have other classes.",
    "WARNING! DO NOT TAKE! This professor is the WORST! The best analogy of this class (as described by multiple successful upper division computer science students) is like \"teaching algebra to a kindergartener\". His bar/pace is so high that it is literally impossible to pass without cheating or having prior experience. Avoid at all costs.",
    "This class wasn't the easiest, but I think Pattis is an excellent teacher. It was challenging in a good way. The tests are hard, but he gives plenty of opportunities for extra credit here and there. He always keeps students updated, which is nice.",
    "Boring class.",
    "Lab assignments are confusing. I do not know what he wants.",
    "This class will keep you busy throughout the week but you will learn a lot. Do not procrastinate on lab assignments and do well on quizzes and you'll pass. Nice prof but dry lectures. LARC helped me through those topics I didn't understand in pattis' lecture.",
    "Very fair grader. Extra credit opportunity if you turn in assignments early, curves well. Exams are tricky but studying is minimal. He tests mostly on how well you understand the main topics he outlines for each exam. He responds to e-mails in minutes. Very nice guy. Programming projects (except for the last one) were boring, long, but rewarding.",
    "Charismatic professor with an incredible amount of knowledge, and not just in his field. Can seem a bit abrasive in lecture, but is a nice guy if you get a chance to talk to him. If you understand the material, you're fine. If not, make a point not to fall behind.",
    "Lectures are super boring.",
    "PATTIS IS AMAZING. He's an extremely systematic and organized professor. He REALLY helps the students as best as he can with OH, online OH, being there during lab, etc. His class is tough, no doubt about it. But his grading scheme is MIRACULOUS. It evens everyone out. I ended up with a B even though I had a C- at some point during the class.",
    "It's 6 units, so you need to put in some time. Weekly quizzes (kinda tough) weekly programming assignments (worth most of your grade. if you know what you're doing, they're easy & you can get EC on them). Midterm is EXACTLY the quizzes. Final is basically the last 2 (of the 6) programming assignments. Fun Class. Not Hard. I wish i tried on quizzes.",
    "6 unites class. if you have no computer science experience, AVOID AT ALL COST. the amount of work (weekly quiz, weekly programming assignment) will take all of your free time away. The exams are all written exams. So no MCQ.",
    "He's a fantastic teacher and his class really isn't that hard. His midterm and final are brutal but they're curved a ton to make it fair. He's really friendly and his lectures are interesting.",
    "Honestly, you need to put time into this class, but that shouldn't stop you from taking it. I hate how students only care about how easy a class is. I would think students attend college to LEARN something. But as I can see, that is not the case.",
    "If it takes you more than 2 hours to finish the 1st quiz, drop the class. Also, programming assignments take more than 2 hours sometimes me and my lab partner spent 2 days working on them, and my partner was almost going to graduate as a math major. when we asked for help, we just got hints from the TA and Pattis.",
    "Incredible instructor. The class is a *lot* of work, so be prepared, but all the of the assignments, quizzes, and exams ensure you thoroughly understand the course concepts. Tons of notes and diagrams available on his website to supplement/replace the textbook. He has many office hours for answering questions, and answers email often too.",
    "He is a good but hard professor. If you really want to learn,take his class, you will learn a lot. there are 5 programs,weekly quiz, two lab exam,midterm and a final. Midterm and final is hard so you need to do really well on programming and week;y quizes.",
    "really disliked the teacher. he knows the stuff really well n amazing but his teaching style isnt the best. all the lecture notes are atleast 10 pages long boring boring boring..",
    "One of the best professors. There is a lot of work, but if you work hard you'll be fine.",
    "Definitely a lot of work. Take-home quiz every weekend (trust me, not easy at all), 4 programming exams, 6 programming assignments, midterm, and final. You don't have to buy a textbook because he basically wrote out the entire textbook on his website.",
    "Overall I'd recommend. Explains things well and is always willing to help, I learned a lot in his class. That being said he does move through material pretty fast. If you are taking ICS 6(the excel course) for G/E reqs I would not recommend taking him unless you are willing to work as his class is not a walk in the park like most other G/E's.",
    "A very experienced professor who genuinely cares about his students. The workload for the course is no joke though. Labs are confusing at times, midterms are challenging, and there are weekly quizzes which feel like minilabs in themselves. However if you take the class seriously and work hard, you'll feel very prepared for upcoming cs classes.",
    "Pattis is a very experienced professor and that is why I was so shocked the class performed so poorly under him. His lectures are very boring and he constantly made insults about the students right in front of our faces! Also he promised to bring doughnuts to lab, and never did! Also he stares at the back wall during lecture....creepy.",
    "An overall great professor. He responds quickly to email, posts scores for all quizzes/hw/tests online, and is very willing to help students. Only negative: Midterm and Final are too difficult, but his grading is very fair. Work hard on homework and quizzes and you won't have to worry about the exams. The textbook was never used, don't buy it.",
    "Great professor - has a bunch of resources available. If you zone off during lecture, you can just read it online because he posts all his lectures and they are extremely detailed. Gives a take-home quiz every week that is extremely helpful if you take the time to do it. Labs took forever. Very time consuming class, but I learned so much!",
    "Java... o-ho-ho-ho... Hard class, lecture is 3 hrs long, and boring... After an hour - impossible to understand what he's saying. Labs are easy at first, but then they get harder. Programming exams are good though. Final and Midterm - too long, don't relate to class. His name - Richard - is the best way to describe his personality, you know ^^",
    "Extremely good! Gives lots of information in lecture - usually more detail than on tests. Highly knowledgeable and interested in the subject. The material was difficult, but he gives plenty of EC and his exams are very fair, and he's usually available to help you. He inspired my interest in programming and got me excited to be a CS major.",
    "Professor Pattis is one of the best teachers to get as an ICS student here in Irvine. He makes you work smart, not hard. You gain a very good understanding of the topic if you attend the lectures, and you can definitely do well because of him. He challenges you. That is why people sometimes find it difficult, but then again, it is computer science.",
    "His lectures are too long... The midterm and final are too hard, but the programming exams are good. If you can't decide whether you want to take this class of not - take it. Didn't go to the lectures - got an A.",
    "Pattis is the kind of teacher who would be excellent for upper-div courses. He posts HELLA notes which you have to be nocturnal to be able to read them all. Labs are fair, but challenging. Take-home quizzes the same. Programming exams were a good grade booster for me. Midterm and final are hard so study, but you can definitely pass this class.",
    "Wonderful professer who does a lot of neat lectures with important material that needs to be covered. His tests and quizzes are puzzling and challenging, making them slightly difficult, but with the inclusion of programming assignments the class is well-balanced and is one which is surely a good choice for anyone needing to take ICS 23.",
    "If you need to take ICS 23 at UCI take it with Pattis! A very difficult class for people relatively new to programming. His grading sometimes can seem unfair, since people who can program get an A+. Still Pattis is a kind teacher who cares a lot and one of the best in ICS at UCI",
    "Awesome teacher, MUCH better than the rest of the CS professors at UCI. Has a website that actually has a search function for his class site, which helps immensely. Has copious amounts of office hours, tests are not as bad as other CS professors. Also has a &quot;normalization&quot; curve in case average scores on tests dip below 70%.",
    "Good teacher who definitely knows what he is talking about. Class was challenging, but also fun at times. The final was incredibly difficult (average was a 115/200). If you keep on top of things from the beginning until the end it should be a fun class. DO NOT FALL BEHIND. If you do, you're in trouble.",
    "He is a really nice guy and very helpful. Lectures were long, but the notes are online if you zone out.",
    "Very chill teacher. Easily understandable and easy grader. Lecture notes are online and as long as you read all of them you'll be good. Quizzes are hard but programs and tests are fairly easy. Definitely recommend him to anyone. And this is coming from someone who has never programmed.",
    "Difficult to keep up sometimes for new programmers, but he clearly lays out projects and is very accessible. Tests aren't too tough and he uses a very easy grading scale. Lectures can be a little dry as always with programming classes",
    "I really like Pattis. He's extremely dedicated and cares about his students. Everything you need to know is written out in wonderful online notes he uses for lectures. If you pay attention in lecture, you don't really need to read or take notes.",
    "Great teacher. Tries to give you the highest possible grade possible and is concerned about the success of your future. Highly recommended.",
    "This course was easy, professor teaches well. Read the lecture notes and do the problems he assigns and you'll be well-prepared for anything.",
    "Highly dedicated teacher. Notes online, though much more beneficial to attend lectures. Attends labs to help students debug. Midterm/final mentally exhausting, but highly reflects the quizzes, which aren't hard if you pay attn in class. A self-pronounced geek, which is a good thing when you're taking compsci!",
]