[
  {
    "year": "1st",
    "submission": "This is a very good university, navigating it is easy and fast."
  },
  {
    "year": "1st",
    "submission": "Beautiful campus with a flowing circular design. Great professors, strong Computer Science department. Major companies recruit at career fairs (Google, Amazon, Facebook). Irvine is a great location for tech and altogether a beautiful city."
  },
  {
    "year": "1st",
    "submission": "The school is not that kind of big fancy school, but the environment around the school is incredible."
  },
  {
    "year": "1st",
    "submission": "Beautiful Campus"
  },
  {
    "year": "1st",
    "submission": "The safest place you can get, period"
  },
  {
    "year": "1st",
    "submission": "Satisfied"
  },
  {
    "year": "2nd",
    "submission": "Parking sucks. Most of lectures are useless. My worst decision attending to this damn school."
  },
  {
    "year": "2nd",
    "submission": "Irvine is a great place but you have to join the clubs to get the full experience of a college life. Otherwise, the social aspect is pretty meh and its very boring on the weekends. The food on campus is okay but we have a university village right next to campus with a lot of good food choices. The clubs also sell food. Try boba while you're here!!"
  },
  {
    "year": "2nd",
    "submission": "Social science majors are generally good. This school does good overall. It gives you opportunities but you also have to look for them. Socially its dismal, but it depends on your background there is a chance that you can be very happy socially."
  },
  {
    "year": "2nd",
    "submission": "So glad I chose to go here. Excellent decision socially, academically and environmentally."
  },
  {
    "year": "2nd",
    "submission": "I love it so far!!! ZOT ZOT ZOT!"
  },
  {
    "year": "2nd",
    "submission": "I think initially, coming to this school, I expected it to live up to some of the ratings on the site. But I have been here 2 years, transferred. My experience has been wonderful. I joined a dance team on campus meant for beginners, and coupled with awesome people, the dance , gaming and academic communities are fantastic! Live @ UTC or w/ friends!"
  },
  {
    "year": "3rd",
    "submission": "UCI is a great place to learn and it is taken very serious but socially it is pretty dead. There isn't much to do at school it is mostly frats and sororities that do things but some of them are pretty weird. There isn't much to do if you don't have a car :/ the school social life is pretty boring."
  },
  {
    "year": "3rd",
    "submission": "Just transferred in, but it's a great school in these aspects. However, I'm concerned about where our tuition money is actually going and why it keeps rising."
  },
  {
    "year": "3rd",
    "submission": "This campus is great, if you are a transfer, rest assured you've been through the worst. Classes and professors are chill, some harder than others, but overall a great experience. almost no outside life if you don't plan for it, gotta work extra to get social. Food almost all around, and good walks, weather is also great! 8/10"
  },
  {
    "year": "3rd",
    "submission": "ICS classes tend to require partner assignments and partners tend to be flakes. Soc Sci 10ABC series sucks- badly designed classes with terrible instructors. University is inflexible about math requirement (for all majors) take this into consideration. Social life only extends to Asian dance crews."
  },
  {
    "year": "3rd",
    "submission": "Beautiful campus, beautiful weather, nice people. Professors are tough and classes are hard but hey, that's college."
  },
  {
    "year": "3rd",
    "submission": "The more effort you put into the school the better experience you are going to get. The social scene is dead if you expect it to come to you. You have to find the people you want to be around via clubs or finding people. Classes and professors might be hit or miss but guaranteed you will find one class or professor that you will enjoy."
  },
  {
    "year": "4th",
    "submission": "It's an absolute pleasure to be a part of a campus experiencing a meteoric rise. Invest in UCI stock."
  },
  {
    "year": "4th",
    "submission": "UCI is a great school for serious workers &amp; those in STEM fields. There's not really a social scene for you here unless you get involved with Greek Life or you play video games like all the nerds here lol. I feel like many students (particularly the Asians) feel a pressure to succeed &amp; get good grades. I've never been a minority til I came to UCI."
  },
  {
    "year": "4th",
    "submission": "I transferred from community college to UCI in the Fall for computer science. The school is very friendly and there's lots of social involvement with clubs, etc if you put yourself out there. The campus feels welcoming and there is a lot to do if you're willing to drive a bit. Lots of great restaurants nearby, especially if you're into Asian food."
  },
  {
    "year": "4th",
    "submission": "I absolutely love this school. So easy to get around and to get involved."
  },
  {
    "year": "4th",
    "submission": "Really good school with opportunities everywhere. Get involved, plan things out, have a positive attitude and you'll love it but you have to get involved. Parking is expensive. Over-acceptance impacted classes, parking, study place--everything, it felt crowded this year but things will probably ease up next year. They're making new halls &amp; apts."
  },
  {
    "year": "4th",
    "submission": "Good campus, everyone sleeps on it! Do not mind going to this school whatsoever, 10/10 choice. If you go there and don't wind up in Middle Earth you won't regret it."
  },
  {
    "year": "4th",
    "submission": "Its the best place to learn unlike other grad schools they focus more on education it may look conservative campus but we are here to study n we got to do that right"
  },
  {
    "year": "Alumnus",
    "submission": "I was an exchange studet at UCI more than 5 years ago. It had great courses and educational opportunities but was a little boring in terms of social environment, especially for international students. While it was rather easy to get to know other international students, I needed to make some efforts to reach out to the local students' community."
  }
]