[
    "Great school, I love UCI.",
    "This is a very good university, navigating it is easy and fast.",
    "It's an absolute pleasure to be a part of a campus experiencing a meteoric rise. Invest in UCI stock.",
    "I was an exchange studet at UCI more than 5 years ago. It had great courses and educational opportunities but was a little boring in terms of social environment, especially for international students. While it was rather easy to get to know other international students, I needed to make some efforts to reach out to the local students' community.",
    "The more effort you put into the school the better experience you are going to get. The social scene is dead if you expect it to come to you. You have to find the people you want to be around via clubs or finding people. Classes and professors might be hit or miss but guaranteed you will find one class or professor that you will enjoy.",
    "Its great",
    "Its good in general.",
    "Social science majors are generally good. This school does good overall. It gives you opportunities but you also have to look for them. Socially its dismal, but it depends on your background there is a chance that you can be very happy socially.",
    "Beautiful campus with a flowing circular design. Great professors, strong Computer Science department. Major companies recruit at career fairs (Google, Amazon, Facebook). Irvine is a great location for tech and altogether a beautiful city.",
    "Its the best place to learn unlike other grad schools they focus more on education it may look conservative campus but we are here to study n we got to do that right",
    "The safest place you can get, period",
    "This campus is great, if you are a transfer, rest assured you've been through the worst. Classes and professors are chill, some harder than others, but overall a great experience. almost no outside life if you don't plan for it, gotta work extra to get social. Food almost all around, and good walks, weather is also great! 8/10",
    "UCI is a great school for serious workers &amp; those in STEM fields. There's not really a social scene for you here unless you get involved with Greek Life or you play video games like all the nerds here lol. I feel like many students (particularly the Asians) feel a pressure to succeed &amp; get good grades. I've never been a minority til I came to UCI.",
    "ICS classes tend to require partner assignments and partners tend to be flakes. Soc Sci 10ABC series sucks- badly designed classes with terrible instructors. University is inflexible about math requirement (for all majors) take this into consideration. Social life only extends to Asian dance crews.",
    "The school is not that kind of big fancy school, but the environment around the school is incredible.",
    "Parking sucks. Most of lectures are useless. My worst decision attending to this damn school.",
    "Parking sucks. Most of lectures are useless. Should have gone to somewhere else! I made a worst decision by attending to this school.",
    "I love it",
    "Terrible choice attending this school",
    "I transferred from community college to UCI in the Fall for computer science. The school is very friendly and there's lots of social involvement with clubs, etc if you put yourself out there. The campus feels welcoming and there is a lot to do if you're willing to drive a bit. Lots of great restaurants nearby, especially if you're into Asian food.",
    "I think initially, coming to this school, I expected it to live up to some of the ratings on the site. But I have been here 2 years, transferred. My experience has been wonderful. I joined a dance team on campus meant for beginners, and coupled with awesome people, the dance , gaming and academic communities are fantastic! Live @ UTC or w/ friends!",
    "Satisfied",
    "Beautiful Campus",
    "yes",
    "I absolutely love this school. So easy to get around and to get involved.",
    "Irvine is a great place but you have to join the clubs to get the full experience of a college life. Otherwise, the social aspect is pretty meh and its very boring on the weekends. The food on campus is okay but we have a university village right next to campus with a lot of good food choices. The clubs also sell food. Try boba while you're here!!",
    "Really good school with opportunities everywhere. Get involved, plan things out, have a positive attitude and you'll love it but you have to get involved. Parking is expensive. Over-acceptance impacted classes, parking, study place--everything, it felt crowded this year but things will probably ease up next year. They're making new halls &amp; apts.",
    "So glad I chose to go here. Excellent decision socially, academically and environmentally.",
    "UCI is a great place to learn and it is taken very serious but socially it is pretty dead. There isn't much to do at school it is mostly frats and sororities that do things but some of them are pretty weird. There isn't much to do if you don't have a car :/ the school social life is pretty boring.",
    "I love it so far!!! ZOT ZOT ZOT!",
    "Love UCI!",
    "Good campus, everyone sleeps on it! Do not mind going to this school whatsoever, 10/10 choice. If you go there and don't wind up in Middle Earth you won't regret it.",
    "Its a beautiful campus, a lot of diversity (Minority is the majority), SAFE, expensive af though, respectable reputation, not a party school.",
    "Getting batter year by year! and harder to get into",
    "Just transferred in, but it's a great school in these aspects. However, I'm concerned about where our tuition money is actually going and why it keeps rising.",
    "Beautiful campus, beautiful weather, nice people. Professors are tough and classes are hard but hey, that's college.",
    "Really good campus, has a good vibe. Could use a better distribution of food locations (needs more food closer to engineering and RH). Bikes and longboards are banned on the main road around campus during the day so walking is a thing. Research opportunities are plentiful (even for undergrads) and the professors are overall pretty good (CompSci)",
    "Professors here are either hit or miss. Parking is a torture. Everything else is fine.",
    "I stayed in the new dorms in Mesa Ct - they weren't finished yet. Surprisingly, having 3 roommates wasn't an issue. The food was okay. I commute now and I like it much better. I chose to apply to UCI over UCLA bc the campus layout and location was SOOO much better.",
    "First quarter here at UCI and I loved it! The campus itself is so beautiful and everyone on campus is amazing too! Haven't had one bad professor and I only look forward to my future endeavours here at UCI. Get involved from the start if you're not too busy, cause that's what I regret not doing. Overall though, UCI was my best decision. ZOT ZOT ZOT!",
    "Love love love this school. Network heaven. ALL of the professors are extremely cerebral. Land of opportunities. If you can't make it here, you can't make it anywhere. The world is your oyster at UCI. Stay disciplined about your studies, treat your teachers well, and your road to success is paved with gold. Oh the librarians and UROP are AWESOME.",
    "Beautiful location (near beaches and parks), progressive faculty, clean green campus, and lots of eateries on campus or across the street.",
    "School is awesome, classes are very in-depth, the food eating areas are great. However, high enrollment levels (at least in my graduating class), buildings are not too interesting looking, and prices are expensive nearby. Check out the subreddit for some quality memes though.",
    "The campus itself is extremely beautiful there is always somewhere quiet that you can study.",
    "UCI has the best study spaces.",
    "Pretty good campus",
    "The UCI campus is beyond beautiful. The school offers many chances to be involved in research or clubs. This school is not very diverse and lacks in that category but the students are well rounded and great people. I am proud to call myself an anteater",
    "Fun campus, everyone here is very nice and welcoming. Good housing and respected professors.",
    "UC Irvine is a solid school with a solid campus. Everything here is solid. There are social events, but there seems to be less compared to other schools. I personally really like the food.",
    "it is good......",
    "uci has its ups, clubs and people are great, feels like people care about you and you're safe, but it shares all the same downs as all the other uc schools, researchers as teachers who cant lecture to save their lives, they basically have their grad students do all the real work and that can be good or bad, and overly impacted classes.",
    "Great school and stuff",
    "UCI was not my top choice, but I fell in love with the school once I took a tour. Definitely, it is a good school with an accessible location. The environment of the campus is pretty awesome!",
    "very nice shool",
    "Good school for Engineering/CS",
    "good one",
    "You will feel isolated by all of the international students.",
    "I had the best time of my life here. I love going back to visit. It's a beautiful campus with laid back faculty. You get out what you get out what you put in though. The research opportunities are second to none. That opened up countless opportunities for me. And don't forget to take the humanities core track. It really opened my mind.",
    "Throughout my high school experience, learning and going to class always felt like a chore. UCI has changed my outlook on school. I now NEED to get to class and learn or I'll feel bad. This school is very friendly, light hearted, and inviting. Students and faculty members all care about you and your success. I am very happy to be attending UCI.",
    "I love it here, everything about it is great",
    "Could use a lot of help socially, other than that its a great place to be.",
    "Overall it is a good school, really safe and with lots of club. Good education. Professors are better researchers than teachers. Opportunities depend on the department you are part of. University is well respected. Best way to get the most out of it is to join a research group/club as soon as you can and focus on that. Overall It's a good school.",
    "UC Irvine is located in a very strategic area of Southern California. Traffic jams are uncommon in Irvine. The roads are wide and there exist a bunch of luxurious apartments around here.",
    "Very glad I'm at UC Irvine! Profs are excellent (I'm Bio/English major), campus is peaceful and beautiful. Libraries are big and quiet. Many campus clubs and some trips to local Arts Ctr for free performances. I volunteer at UCIMC and use free shuttle service. When I need break, I go to beaches (lots of them nearby) or across street for food.",
    "UCI's a great school and the Anteatery (Mesa Court Dining Commons) is underrated",
    "Love the professors and TA's, but people here are a bit scary to approach (speaking with the opinion of a transfer student). Safe school, good food, but nothing to do and everything closes at 9 for the general part. Take advantage of all the free stuff!",
    "UCI is extremely underrated compared to the other UCs. Its a 10 min drive from the beach, great food, hundreds of clubs to join, and super safe. Academics are great, the social aspect always gets a low rating but its honestly what you make of it, it really isn't hard to find a party, usually at least a few going on every week.",
    "The department here is very very irresponsible! If something wrong happened to you, no matter if you are innocent or what, they just tell you go to ask another department and send you a psychologist.",
    "UC Irvine is a hidden gem within the UC's. Just miles from Newport Beach and in the heard of Orange County, UCI is the home to elite academic programs with an ever-growing environment and opportunities. While many people do not know UCI and it lacks the typical college social and athletic scene, there are opportunities to make the most of your time",
    "Only negatives is the social life here!",
    "Decent School",
    "Good campus",
    "Academics are at the center so frat/sorority live is more low-key, but that is good! food is amazing around campus and the location is safe, in great condition, and theres so much to do!",
    "it's legit",
    "As far as the undergraduate business program is concerned, UCI is only behind UCB in the state. Provides lots of job opportunities in Southern California, but not so great with people looking for jobs out of state. Not a good place for people looking to get into high profile careers like management consulting or investment banking.",
    "I LOVE IT!!!!!!!",
    "A beautiful campus with lots of professors that really care about their students and want to help them achieve their goals!",
    "UC Irvine is a really great campus filled with diversity (despite it being commonly known as University of Chinese Immigrants, just jokes!). Coming here was the best choice I have ever made and it will go down as one of the best environments I will ever be in. Love the atmosphere and professors, those who are coming here; you won't regret it.",
    "Very calm environment. Lots of walking. UTC is fun sometimes. Beautiful campus! New Mesa Court Towers are very nice! I love them! Got into UCLA, but committed to UCI because I LOVE UCI and its not as competitive and you dont have that pressure that you have to be a doctor because youre at ucla. LUV UCI!",
    "new dining hall and dorms are perfect",
    "UCI is da bomb",
    "I luv UCI",
    "UC Irvine is an incredible school. It is underrated by most people because it doesn't have the same name recognition that UCLA or Berkeley have, but the education is the same, if not better. I have never lacked for opportunities and feel like the education I am getting is worth what I am paying for.",
    "UCI is an overall great school, it has its good and bad professors as all colleges do. Despite that, the campus is really nice. So far I have not met any person who has been rude or mean to me personally, but there are some out there. There are a wide variety of clubs and if you want to be social it is highly advised that you put yourself out there",
    "I love UC Irvine! It was definitely the best choice for me! The campus is amazing and everyone here is so friendly! Best by far!",
    "Life at UC Irvine is definitely what you make of it. The social aspect is very alive (you can catch some lit parties every weekend), you always feel safe around here, the weather is mostly perfect, the whole environment just is happy. Make it the best!",
    "This university is truly a blessing. The facilities and staff members are top quality. There are many opportunities to get plugged in and involved with clubs. And you definitely can't go wrong with a walk in beautiful Aldrich Park on your way to class.",
    "Very nice overall, and Im only a freshman",
    "UCI is a mid tier UC. So, its comparatively one of the better universities in California. Unaware of reputation outside California. Definitely better than most CSUs but nowhere close to UC Berkeley. Irvine is considered to be one of the safest cities in the country. Alumni network is not too strong. Also, experience will differ according to major",
    "Great campus but one can get easily lost in the huge school both emotionally and physically. It is up to the student to go out of their way to make friends, go to club meetings and be social. This school does not baby you. You have to do your work and the teachers are generally very tough but good at teaching. VERY fast-paced. Do not underestimate.",
    "UCI is a fantastic place to be! A well rounded school and everyone here is so kind. The faculty and administration is also very helpful and welcoming.",
    "Academics are great, and I feel that the professors really do take their time to help out. Socially: UCI kids are, for the most part, more closed off and cliquey. This isn't always bad - if you're able to find your niche, you're honestly set. However, the social scene doesn't cater to everyone, so be aware! Overall, decent but not amazing school",
    "Zot, zot, ZOT!",
    "I love UCI. Here we have the best education, food, entertainment, etc.",
    "It's a University where you have to push yourself and be great! All of the professors in the humanities and bio Sci help you understand your potential, but they make you work and realize that you can one day help change the world. With all that said, no one really helps you with the transition to the real world. It's hard to get a job.",
    "Students are not friendly at all. They are full of themselves. The workload of reading is doable for rich students who get paid from their parents. It's not possible for a poor student who needs to work full-time study at UCI. Professors are tough and not understanding. I was much happier at other school but not UCI.",
    "It's better than it's reputation will say, but it is still not quite top notch. The education system is probably just as good as the other top UC's with great professors, classes, and academic assistance. There is just enough of a social scene to be happy if you are into that stuff too. Make sure to have a lot of units to get the classes u want.",
    "UC Irvine is a cool school with a lot of opportunity, but there are a lot of really boring students. It's difficult to connect with people unless you are very involved on campus. On campus housing sucks especially since there are so many families living in Irvine all around campus.",
    "In my opinion, UCI was a great school. The only thing I regret is not enjoying my college expereience to the fullest. I highly encourage anyone to be very involved socially since there are many social opportunities at the school. The only downside was the food. The food offered is not very good so I would recommend bringing your own lunch.",
    "Very small campus compared to other schools (less walking ;). Clubs for almost any interest out there, easy to get involved and find connections! Not too many hangout places right next to campus, but a lot within a 10 minute drive!",
    "Great campus. Many opportunities. Competitive in classroom.",
    "Great University. Glad I came here !!!",
    "For social, you just have to find the right people and find your place and you will be perfectly fine. I am a first year and have successfully and have found my place very fast. I am glad to call this my home. It is a UC though, it is challenging.",
    "UCI is kind of under the radar with its reputation but all of the students that go to UCI know how special it is. I honestly can't imagine another campus being the same way that UCI is -how welcoming the community feels and every involvement that it offers. UCI is a great place for academic excellence as well as personal learning experiences!",
    "So glad I came to UCI!",
    "I came for the Criminology program because it's the best in the state, so that's a major plus. The freshman dining halls are on the low end, but everything else is good. The area is a good college location esp. LA being close by. Make friends and join stuff and you'll have a great time! Wish the frat/sorority houses were nicer though, I wanna join",
    "Wouldn't choose another school over UCI.",
    "This school is hands down the best! It's rapidly rising in the ranks and will, without doubt, make it to the UCLA/CAL level in the mere future. Its already in the top 10 public universities in the nation!! Its very beautiful and has everything to offer. The people are all very friendly and you just always have a good time.",
    "UCI is definitely the school for me.",
    "This is the place to be",
    "I absolutely love UCI. Got accepted to others and decided here after talking to other students -- the faculty is amazing and the location is just five minutes away from the beach. There's tons of nightlife around the Costa Mesa and Newport areas if you know where to go. I couldn't ask for a better college experience, choose UCI!!!!",
    "I was accepted at UCLA, but I'm super glad I came to UCI. My professors have been great and the campus is BEAUTIFUL with lots of trees, close to the beach. More food places have popped up and I can walk to many of them. Parking can be a crunch if I'm running late. I made some good friends here and all of us are glad we came to UCI. AAA+++",
    "UC Irvine has given me the opportunity to learn a lot of things and I am thankful to be in such a nice and prestigious university. I have always liked UC Irvine, and I am proud to be an Anteater! UC Irvine has a lot of nice choices and there are not many problems around. I will miss this school and all the friendly people I met when I graduate.",
    "Good school but not too much going on.",
    "Located in Irvine, where there is not a lot of people, especially foreign people, know about it. The surrounding is very serene and calm. But the cost of living here is expensive, but I like it here a lot.",
    "I've made the devision to come to UCI. I chose it over UCSD.",
    "Great dorm life. Good people. Nice campus with many fresh opportunities to become something great. UCI faculty and staff are genuine and WANT to make you succeed. Just make sure you put the effort in it, to win it. The campus has a huge park to not take for granted. It's also near many beaches, hangouts, themeparks, and places to get your grub on.",
    "Nice",
    "This school should have much more hype than it actually does. The campus is gorgeous and in a really really nice area. We're a short drive away from newport beach and there's a party every night if you know the right people. There's a lot of clubs and orgs and the school really cares about their undergrads and there's a lot of opportunities.",
    "Amazing school. Only thing that lacks is the social life, but if you're choosing your education based on the social life you don't deserve one anyways lol",
    "The school is great. Great campus, great atmosphere and great people. The campus is very accepting and very progressive. It's also a very nice location, close to the beach and a stone throw from Disney and multiple malls. There are several clubs offering to satisfy many interests. The only issue is housing is a bit far, but the bus makes up for it.",
    "The engineering department has a lot to work on. I'd look into a more established engineering school before considering UCI. They have a lot of profs that are new to the material and hardly prep to teach. Not really a learning environment, more of a research facility with overpaid test proctors. Go to a CSU where they actually teach.",
    "UCI works hard to make this campus feel like a home away from home. The internet was iffy in the beginning of this year in Mesa Court, but it's all fixed now. The dining commons also might not be the best, but the environment and people at UCI surely make up for it. So happy to be part of the anteater family. ZOT ZOT ZOT!",
    "Nice location",
    "Very good environment with a lot of opportunities.",
    "cool place to be",
    "It is amazing. come and be an anteater",
    "-",
    "I couldn't be happier. Chose it over Davis, San Diego, and waitlist at UCLA. I have no regrets.",
    "UCI is a very distinguished campus that has a lot to offer. There are a lot of clubs and you will find your place. The campus is really nice and Aldrich Park is very peaceful. Dorm food is not the best, but it will get you through. Overall, a very good university.",
    "While I was going through the lists that this website provided me to rate, I acknowledged more that it really is the best school! We have a good reputation, especially starting this year, suburban local areas are so nice bunch of good restaurants nearby, and killing library! My happiness at UCI is beyond 100%!",
    "I'm currently a sophomore at UCI. I really do love the atmosphere here, mainly because I'm introverted and only have a few close friends who I hit up sometimes. The dining hall food does suck, but there's a lot of good food in Irvine if you have a car. If you're laid back, chill, and don't really care for parties, UCI's your place.",
    "Much better than what you expect from it's ranking.",
    "UCI's awesome. It is near many wonderful restaurants, the campus is fresh and welcoming and safe. If you live in campus and need a place to study, the libraries and the gateway study center are open, but sometimes, they get crowded and there are barely empty seats. I like Irvine and I love UCI.",
    "Amazing campus, makes you feel right at home. If you get homesick you can also go to Disneyland since its right around the corner, I heard it's the happiest place on Earth! Overall, I loved it!",
    "I majored in film&media studies and I absolutely love this school!! UCI provides me great opportunity and broad my horizon. It will help me get into this field in the future.",
    "Great school!",
    "People are very friendly and instructors are kind and helpful. Education is great! There are plenty of opportunities for research and internships. The social scene is not really that prominent especially since it is in a suburban area, but you can always find a way to have fun.",
    "UCI is a great school with an awesome campus. My advice- get involved in a club or some organization, and bring your car. Otherwise, life will be boring. But if you know where to look, UCI has a great social life and leadership opportunities. Plus, we're right next door to sunny Newport and Disneyland. (But also, parking is a pain).",
    "Great campus, lots of friendly people, amazing education, lots of opportunities to do awesome things! I love UCI, Zot Zot Zot!",
    "This campus is beautiful! Great faculty! On my way to grad school to get my PhD! Thank you UC Irvine!",
    "VERY happy I attended UC Irvine!",
    "UCI has a reputation for not being a social school, but there are plenty of people here who are friendly, sociable, and down to party.",
    "Ruled by tons of International Students!!!! I like the campus because Is not huge, it's clean green campus and easy to get around. Hate the parking and driving all together in Irvine.",
    "But I dont Wanna",
    "Very boring atmosphere, people look grumpy and just sad sometimes. Wish I visited the school before choosing to come here.",
    "The best",
    "It's a nice, clean campus that's easy to get around in since the foundation is based off the central park. Located in a safe, large city but a problem is many places are driving distances away from UCI",
    "perfect location, education and value.",
    "Best ever",
    "BEST IN THE WORLD",
    "Most underrated university ever. I love UCI and this place has shaped my life. Beatific campus, world renowned academics, seller reputation, many opportunities, chill people, great environment, what more can you ask for?",
    "best campus , food, and location",
    "I love UCI! Everyone is friendly and willing to help you out!",
    "best campus ever",
    "An amazing school that's given me a lot of opportunities to get out there. This school has a really good balance of academic and social life. No one's pressuring you to party all the time but if you wanna party, you can. Most of the students are welcoming and trustworthy. Having a car is almost a necessity though! And parking is WAY TOO EXPENSIVE.",
    "The Best!!!",
    "Love this school! ZotZotZot!",
    "I love UCI! We're still pretty up-and-coming but we're definitely a great school and there are so many amazing professors here who are really willing to help students out. Parking is terrible, though! Dining commons aren't the best but there's good food at UTC across the street.",
    "Loving it!",
    "A very amazing school. The atmosphere is very welcoming, it is very safe, and it is full of intelligent and caring students and staff. Proud to be a part of this university!",
    "UC Irvine is great, typical college, hard classes. If you're in a STEM major, expect competition, otherwise that its pretty laid back. Too chill probably for the people who like things happening all the time. If anything it may seem dead, but thats because everyone is out. Irvine pushes you to explore out side and make plans with people",
    "great school, i love it !",
    "Amazing school with an amazing reputation, and rightfully so. Socially speaking, if you are not a freshman the chances of you making friends is incredibly low (transfer students unite, seriously). In your nightmares you will hear \"$2 BOBBA!\" Be prepared to surround yourself with pompous people.",
    "UCIrvine was the only campus to offer my major of criminology. Loving it so far!",
    "Honestly, I think UCI is underrated. Sure, its full of a lot of kids who wished they could have gotten into UCLA (like me), but I seriously LOVE where I go to school. My only tip for future students, is if you want any sort of fun social life, join Greek life! I've made so many friends and don't know what I would do without my sorority!",
    "great school. the people are nice, the recreation center is awesome, professors(the ones that I've taken) are cool, and there are many things to do in your free time",
    "Awesome School!",
    "Lots of different clubs and organizations to join, abundant research opportunities, perfect weather, beautiful campus. Socially dead on the weekends, not a huge party school, but if you like to eat out, you'll have tons of fun. Get a job so you can have a car and pay for parking and gas money, and your four years will be a hell of a lot more fun.",
    "ZOT IS LIFE.",
    "Best decision I ever made! I love UCI 3",
    "I love it here!",
    "The campus is literally eye candy. Its so big and beautiful. I love how its centered around a park. You get to meet many need people and theres just so much in and near school! Go to UCI.",
    "Great Campus overall!! My initial thought was its a beautiful campus and great to just get my degree and graduate. Now, I want to be involved more and just wish there offered more digital art courses that I could take. Otherwise, awesome school.",
    "UC Irvine is underrated--even if Irvine itself is not a party city, Newport Beach is right next door, not to mention Disneyland, San Diego, Los Angeles, all a mild drive away.",
    "Great people!",
    "Irvine is not my first choice actually, but it is what I chose. I just fall in love with it! Nice campus and services, but expensive for international students.",
    "UCI is seriously like a hidden gem. Most of the world don't know how good students have it here because they're too caught up on world ratings that can be based off of anything. Weather is seriously superb here! Everyone here is always down to help each other out . It's FULL of opportunities but you have to seriously have to get involved!",
    "I don't believe UC Irvine receives as much reputation as it deserves. It really is the hidden gem of the UC system. I think a lot of people overlook the campus because it is not as distinguished as Cal or UCLA, but in all honesty; UCI provides a great college atmosphere and I am enjoying every minute of my undergraduate career. Zot Zot Zot!!",
    "I am glad I came to UCI. I made better choice.",
    "It is a great place to go.",
    "I honestly think that my choice to go to this school was one of the best decisions I ever made. There are a lot of opportunities to take hold of and chances to make a difference in a community. The location is really nice because there are a lot of places nearby and beautiful beaches that are all within a reasonable distance.",
    "The atmosphere here is really chill. Everyone is really smart, but everybody is nice to each other so there's not that crazy competitive nature you get at more prestigious schools. There are a lot of opportunities to get involved with everything from research to quidditch! Overall, I have really enjoyed my experience here and never want to leave",
    "Probably one of the best schools in the country. UC IRVINE has it all: the brains, talent, reputation, location, world renowned professors, top med school, mba school, law school. Definitely the place to get a solid education with a prestigious name.",
    "It might not seem like much, but UC Irvine is one of the best schools in the country. Please do not turn it down because it is one of the most underrated campuses in the UC system. I love this school. its been a blessing to have been chosen as a student here.",
    "it's an awesome university!",
    "No comment",
    "It's above mediocre",
    "Very boring campus. No cool spots near campus, best thing is that the beach is not far away. Epitome of suburbia.",
    "UCI has a great vibe, great education, cool people, and a very good location. The social life lacks a little, but can be made up for with the Greek life..",
    "I love UCI. For those who think UCI might be boring because of the area, you're wrong, it's what you make of it. If you're into parties and all of that, the greeks are pretty good with that. It is kinda had to get out of Irvine if you don't have a car but other than that, UCI is a great school, absolutely beautiful campus! I'm so glad i came here",
    "UCI has lots of opportunities you can explore. As a business major, I am able to join various business clubs and fraternities. Although the foods are ok, but the atmosphere of the campus is fabulous.",
    "everyone here is super nice and they genuinely want to get to know you more than that if ever lost just look left or right and someone is there to help you",
    "This campus is wonderful with numerous trees and hroups of grasses. Besides that, many clubs are welcome everyone yo join their's. As for my experience, there are decent to awesome professsors. However, the weather is not that good since it is extremely hot someday as in my home country, Thailand.",
    "It's great",
    "Hit or miss with the professors. Some are great and some are absolutely horrid. Food choices aren''t amazing but new stuff has been opening recently.",
    "If you love nature you'll love the campus. Always nice to walk around.",
    "It's safe, nice, but challenging.",
    "nice school",
    "It is a really nice place with its programs improving every year.",
    "great",
    "good!",
    "Fantastic chemistry program!",
    "Love UCI!!!",
    "Good school, great education, immaculate campus!",
    "Great school in almost every way; however, horrible counselors for the most part. Most of them are very negative. They seem that they do not care about students' future. All that they care about is saving their school money by kicking out students out of their school. Also, there are some really rude professors.",
    "Very nice and clean school. Social life doesn't really exist unless you are affiliated w/ clubs, groups, or Greek life. Very culturally diverse. Very focused atmosphere for people who actually are making moves to go somewhere after college.",
    "It's a nice campus.",
    "Everything about this school is great!",
    "UC Irvine was a wonderful surprise. I had never toured Irvine before coming and it is not only a beautiful campus, it is also a perfect environment for growth with so many opportunities for research and internships. It's also a great campus for the social butterfly. Greek life is amazing. I would encourage a freshman to join many clubs!",
    "Great campus",
    "I love uci honestly the only thing i can say is come to uci and see it for your self",
    "UCI is seriously a hidden gem! I could not have asked for a better college experience anywhere else. UCI has the perfect balance of everything you need to grow, academically and socially!",
    "I love UC Irvine. It is fairly new, but it is really making a name for itself. They really take care of you here. I wouldn't ask for a better school, this is home!",
    "UCI is a hidden Gem!",
    "I think students should know that UCI is a well qualified school!",
    "Great school, often overlooked. Everyone here loves it.",
    "Irvine is pretty, but completely devoid of anything interesting. If you like chain stores, housing complexes and corporate buildings you'll love it here. UC Irvine probably has the worst social scene of any college ever. Period.",
    "Goood!",
    "EXCELLENT SCHOOL!",
    "It's the best school in California!",
    "I LOVE UCI",
    "If you live on campus life is much more fun then people make it out to be. work on campus it helps you make friends. get to know your roommates and it will become a party time soon ... just don't forget to study and do your work before you have fun. worth coming here. love it !!!! class of 2015",
    "great school for physics students, but not for econ students.If you want to take major as fiance, accounting, you d better change a school.",
    "I am fresh man this year, and this college is amazing for me. The students and stuffs are so nice and they helped me a lot.",
    "I LOVE IRVINE! IM GLAD I CHOSE IT!",
    "so far so good",
    "great",
    "Good",
    "GREAT",
    "Good",
    "Great school",
    "At UCI you'll meet great people and get a good education but you'll be left wanting more from the school's social life. Getting involved is a must or you'll hate your time here.",
    "Loved it",
    "I like UC Irvine very much! UCI is a pretty good school for students to study and live.",
    "This is my dream school. The teachers are difficult but you will get the hang of things. The biggest down fall is the price. Parking is $300 a quarter, even if you have a permit you can still get tickets. Apartments are high priced as well. I would not want to go anywhere else though.",
    "I would say it is the third best UC behind UCLA and Berkeley.",
    "Great school. Has great teachers. Really love the campus and the research opportunities offered.",
    "Challenging academic environment. Many students are pre-med or pre-law, and competition is high.",
    "I have been staying here for two years, everything seems great to me.",
    "Very calm and welcoming environment. This campus does not get the recognition that it deserves! Beautiful libraries. The park is an amazing place to hang out have picnics or games with friends or just sit and study.",
    "best",
    "I didn't know anything about UCI before joining but I have to say it is a nice school. Life is what you make it. Join clubs, don't blame the school for your own laziness ;) also, sometimes its frustrating that you can't get anywhere without a car but all in all, the engineering department is pretty bomb, everything is very clean and pretty too.",
    "Great school, some people consider it boring but it's because they don't look for fun. Newport beach is near and greek life is great.",
    "UCI is located in one of the safest cities in California. It is a very good study environment.",
    "i love uci",
    "This is the third university I have attended in the last 10 years I have been in and out of college. I can say that this is by far the best one that I have attended. They actually care about undergraduate students, and are highly supportive of undergraduates doing research, which is usually the domain of graduate students. Highly recommended.",
    "Beautiful campus! Enjoying it here.",
    "None.",
    "AMAZING school. The campus is gorgeous and not all spread out over the city, so it makes getting around pretty easy. The classes are very good and the professors are fantastic. You WILL get a quality education at this school.",
    "AMAZING SCHOOL! Sometimes it's underestimated, but the experience here so far is amazing! The beach is 10 minutes away!",
    "Irvine is such a great campus. I was accepted into others schools, yes including UCLA, but none compare to the atmosphere of the school and the lifestyle of Irvine residents.",
    "They're welcoming, fun, and make this a better campus.",
    "Learn how to use the library early on, it is your best friend when it comes to research and papers. Don't be intimidated by the Inter Library Loan System, feel free to use it and get any book from any campus. Just make sure to order it a week or two in advance. O"
    "Some say UCI is &quot;boring.&quot; Those are the people too lazy to go and look for something to do. Most parties take the form of kickbacks, which take place anywhere from local apartments to on campus, in the dorms (specifically Mesa Court). The only people who think UCI is boring are the freshmen living in the other dorm, Middle Earth.",
    "None.",
    "Humanities lacks intellectual rigour and opportunities;for this reason the quality of education is mediocre.Few classes are offered .It is almost impossible to double major because most classes are offered once a year.AT UCLA one could easily finish a major in one year.While here it takes approximately three years for one major.how Worthless.",    "The campus is gorgeous and in a safe area. The student body is diverse, which provides a great opportunity to learn about other cultures. At first, it wasn't my intention to go to UC Irvine, but now I am incredibly happy to be here.",
    "None.",
    "It can be boring sometimes, but it's awesome!",    "Computer Science & Engineering major. UCI is a top tier UC along with UCLA and UCB thanks to a private donation, prestige is almost Ivy and quality of classes is excellent. Lots of opportunities to get an interesting high-paying job and internships, awesome location, if you know the right people you can party every weekend in the beach too :P!",
    "None.",
    "You need a car to go into town or anywhere fun really. It's just the people and the government (student and chancellors) that make this school bad. We just need a good association, instead of UCLA rejects. I'm sure we're going to be one of the best UCs but we need time. We do have one fo the most beautiful campuses.",
    "None.",
    "Most of the students here are Asian. Very little diversity .very few things to do. The websites are horrible and take a while to learn to navigate. Very little student support. Apathetic about any issues I.e.tuition increase etc. Crowded and uncomfortable classes",
    "It is in the perfect setting, close to Irvine spectrum, the district, newport beach... There is so much to do!",
    "When I first started at UCI, it was a great school with an impeccable reputation. While I do not think the reputation has gone down much, the quality of the school has. The economy hit UCI hard and so many classes, school services, and even financial aid has been cut. The school spends more money on construction than the students.",
    "UCI is not UCLA or UC Berkeley as it should as a public university that offers an equal comparable education.Instruction is not 'world-class academics'.Professors may be'truly quality professors',but most are apathetic.Not worth the high tuition and the four years.'See for yourself'.How could you dedicate yourself when UCI does not dedicate itself&#63;",
    "UC Irvine is the rare combination of world-class academics, awesome atmosphere, good sports, and truly quality professors (compare Irvine to other schools & see for yourself!). If you are willing to dedicate yourself to your education and to the campus itself, you'll find that UCI will dedicate itself in supporting you as well. Rip 'em Eaters!!!",
    "Not a school for humanities!You will find out as this school offers a dearth of courses, instruction is mediocre,workload is insufficient.Do not attend as the debt crisis will degrade of your education.Look at UCLA and UC Berkely schedule and compare.These students will do better than you in employment,so transfer or have an inferiority complex",
    "Classes here do not resemble university courses,and professors do not even attempt to teach at this level because they believe that you are inferior.If this is a public school, it should not offer a mediocre education, but this school rather demeans you. Especially the English department intends to be novel about its idiotic class titles. A waste o",
    "A lot of people say that UCI is a commuter campus and that it is dead past 5PM. However, it is up to YOU to find out what's going on on campus. Get involved, meet new people, step out of your comfort zone. Being at UCI has allowed me to grow as a person outside of academics. It has a lot to offer and all you have to do is take advantage it!",
    "I love UCI. I wouldn't trade my experience here for anything.",
    "Not Specified.",
    "Coming from a semester system to a quarter system kicked my butt. No time to actually learn and grow. Emphasis on memorization. Most professors are impersonal, not good lecturers, knowledgeable but not good at teaching.",
    "HIGHLY encourage you to go Greek, great social supplement to a highly driven academic environment",
    "Do not attend if you are a humanities major because the quality of courses and instruction will not equate the value of your major, compare to other socal institutions,when it comes to employment.This shows in the reading lists and content of courses,conveying professors'condenscending presupposition of your inferior intelligence, reasoning, etc.",
    "If you are a humanities major and socal resident, and didn't get accepted to UCLA or USC, be a realist and attend two humiliating years at community college and transfer; otherwise, you will be derised as employers prefer UCLA or USC. As an English major at UCI, I await humiliation and unemployment. Ivy league profs treat you odiously.",
    "As an English major, I am dissapointed. English courses are insignificant and inferior compared to other schools. Attending UC Irvine has been the worst and most miserable three years of my life. I am ashame, I do not think that the english major will be valuable and profitable.",
    "Work your butt off and you'll get a good job. Remember that.",
    "I love UCI!",
    "Get involved in a campus organization! There's so much more than attending lectures and discussions. UCI provides so many opportunities to get involved outside of the classroom. I think people overreact when they say it's a dead campus after 5PM. You have to make the most out of your college career so take advantage of everything it has to offer.",
    "Not Specified.",
    "It is a great school with a BEAUTIFUL campus. Most of the teachers are wonderful, just be sure to check on ratemyprofessor before signing-up for classes.",
    "Lots of large lecture courses, and these aren't conducive to getting acquainted with UCI professors, many of whom are amazing. Get to know them & your TAs outside of class. Interacting with professors & TAs will help you with your class work, help cultivate mentor-mentee relationships, and help you when you need letters of recommendation.",
    "This school blows. Go here if you're not accepted anywhere else. This is simply an extension of high school which becomes most prevalent by the elitist indoctrinating fraternal lifestyle that has plagued the campus. The weather is nice and there are a few cute girls in the arts department. They have a Wendy's. Parking is hell. Students are kids. D-",
    "Not a prestigious school, but good enough for your future. Professors and TAs are okay, although not the best. If you are just looking for a degree for employment, then UCI should be more than fine.",
    "I love UCI! The campus has grown tremendously over the past four years that I've been here. I'm proud to be an Anteater. Beautiful campus. Great location. Really nice people. Easy to get involved. Fun campus-wide events. I'm thankful for the experience. ZOT!",
    "I love this school! I'm glas I chose UCI over UCSD",
]